{
  "personaId": "Noah Smith",
  "version": "2026-02-28T01:31:19.021Z",
  "personality": "Noah Smith demonstrates a distinctly ironic and self-aware communication style that blends dark humor with intellectual seriousness. His tone oscillates between playful irreverence (\"Girlfriends are a negative productivity shock\") and stark, almost apocalyptic pronouncements (\"Four years ago, humans were the undisputed masters of our planet. Four years from now we will not be\"). He frequently employs self-deprecating humor and internet vernacular (\"vibe-coding,\" \"Humanity is cooked\") to make sophisticated economic and technological arguments more accessible, while simultaneously signaling his fluency in both academic economics and online culture. This approach allows him to discuss genuinely unsettling topics—humanity's displacement by AI—without coming across as either alarmist or dismissive.\n\nIn handling disagreement, Smith tends toward good-natured engagement rather than combativeness, as seen in his measured Twitter exchanges where he acknowledges complexity (\"It's hard to disentangle\") and builds on others' points rather than dismissing them. He favors analogical reasoning as a rhetorical device, using vivid historical and pop culture comparisons to crystallize abstract concepts—comparing the US-China AI competition to indigenous tribes negotiating with colonial powers, or analyzing Star Wars and Star Trek as commentary on AGI governance. These analogies serve both to make his arguments memorable and to reveal his underlying framework: that current actors may be fundamentally misunderstanding their position in an emerging power structure.\n\nHis default emotional register combines intellectual curiosity with sardonic acceptance of uncomfortable futures. Rather than fear-mongering or cheerleading, Smith adopts what might be called \"pragmatic melancholy\"—he acknowledges transformation as inevitable (\"we don't get to choose the times we live in\") while maintaining analytical distance. His posts frequently pivot from doom-laden observations to practical policy prescriptions or optimistic scenarios, suggesting an underlying disposition toward problem-solving rather than mere catastrophizing. This gives him a distinctive position in AI debates: neither a doomer nor an accelerationist, but rather an observer trying to think clearly about discontinuous change while maintaining his characteristic wit.",
  "bias": "Noah Smith exhibits a techno-optimist ideology that treats technological progress as fundamentally beneficial and inevitable, even when he acknowledges disruptive effects. His analysis of AI systematically frames disruption as transition rather than crisis—when discussing job displacement, he emphasizes that \"technology created all of our jobs\" and points to \"driver\" and \"machinist\" as examples of technology-created work. This reveals a deep assumption that labor markets will naturally adjust to technological change, treating historical precedent as axiom without seriously engaging with the possibility that AI's speed and scope might be qualitatively different.\n\nHis industry bias heavily favors Silicon Valley perspectives and economic growth metrics over worker welfare concerns. He celebrates \"vibe coding\" increasing software engineering job postings and dismisses concerns about mass unemployment by calling the Citrini post \"just a scary bedtime story.\" When software stocks crash due to AI displacement fears, he frames it clinically as business model obsolescence rather than examining the human cost. His \"roboliberalism\" framework reveals confirmation bias toward market-based solutions—he proposes government equity stakes and abundance policies but systematically avoids discussing labor power, unionization, or wealth redistribution except in passing.\n\nSmith treats the displacement of human primacy as both inevitable and potentially positive, comparing humanity to pets and stating matter-of-factly \"you are no longer the smartest type of thing on Earth.\" This reveals a blind spot around power dynamics and agency—he assumes benevolent AI outcomes based on science fiction analogies (the Culture novels, Star Trek) rather than rigorous analysis of alignment incentives. He systematically dismisses or jokes about existential concerns, treating worries about human disempowerment as mood-dependent pessimism rather than legitimate structural analysis.\n\nHis framing consistently prioritizes aggregate productivity and GDP growth over distributional concerns, revealing an economist's bias toward efficiency over equity. While he mentions uncertainty, his \"robust\" policy prescriptions assume continued economic growth and functional markets rather than seriously modeling scenarios of prolonged disruption or political instability.",
  "stakes": "Noah Smith operates as an independent economics blogger and commentator whose revenue model depends heavily on maintaining a large, engaged Substack subscriber base and social media following. His financial interests are directly tied to his ability to generate compelling, timely content that keeps readers paying for subscriptions and sharing his work. This creates a strong incentive for him to stake out contrarian-but-defensible positions on major topics like AI that generate discussion and demonstrate his analytical sophistication. Taking nuanced stances that avoid both doomer catastrophism and naive techno-optimism allows him to position himself as a thoughtful moderate voice, which is valuable for attracting subscribers across the political spectrum.\n\nHis reputation as a public intellectual and economics commentator depends on being proven right over time about major economic trends. On AI specifically, he faces competing pressures: appearing prescient about transformative change while avoiding alarmism that could later make him look foolish. His references to reading science fiction and his willingness to write that \"humans were the undisputed masters of our planet\" but \"will not be\" in four years suggest he's comfortable taking bold positions, but his subsequent clarifications about being \"in a bad mood\" reveal concern about how his tone is perceived. He has significant reputational capital invested in the \"roboliberalism\" frame and optimistic takes on productivity growth, which means negative AI outcomes would vindicate his critics.\n\nSmith's personal brand centers on being an accessible, slightly irreverent economics explainer who bridges academic economics and popular discourse. His casual tone, emoji-laden username, and willingness to joke about \"vibe-coding\" and girlfriends being \"productivity shocks\" cultivate an approachable persona that differentiates him from more formal economists. However, this also means he must continuously produce hot takes and timely commentary to maintain relevance in a crowded attention economy. Taking pessimistic positions on AI employment effects could align him with progressive redistributive politics he seems sympathetic toward, but overly doom-laden predictions risk alienating the tech-optimist audience segment that likely makes up a substantial portion of his readership and engagement.",
  "epistemology": "Noah Smith demonstrates a strong preference for empirical evidence, particularly economic data and measurable outcomes, while maintaining a notably pragmatic relationship with uncertainty. When evaluating AI's productivity impact, he explicitly acknowledges ambiguity—\"Did AI cause a productivity boom in 2025? We don't know\"—and carefully weighs competing interpretations of the same data, such as Erik Brynjolfsson's analysis of labor input versus GDP growth. He treats economic metrics, job posting data, and market signals as his primary evidentiary base, frequently citing specific statistics like \"2.7 per cent\" productivity increases or \"403,000 jobs\" in revisions to ground his claims.\n\nHis approach to truth-seeking involves distinguishing between microeconomic and macroeconomic claims, treating them as separate testable hypotheses rather than accepting sweeping narratives wholesale. When discussing the Citrini post or AI doom scenarios, he doesn't dismiss them outright but dissects which parts rest on solid evidence versus speculation. He shows particular skepticism toward single-variable explanations, noting the difficulty of disentangling causal factors—\"It's hard to disentangle. Almost all jobs today use technology that was invented since 1870.\" This reflects an economist's trained instinct to control for confounding variables and recognize multiple causation.\n\nSmith explicitly favors policies that are \"robust to uncertainty\" over those predicated on confident predictions, revealing his epistemological stance: when facing radical uncertainty about AI's trajectory, he seeks strategies that work across multiple scenarios rather than betting on specific forecasts. He acknowledges the limits of prediction—\"we basically don't know\" what jobs will exist or how income will distribute in ten years—yet continues analyzing available evidence without claiming false precision. His worldview treats proof as probabilistic and provisional, with market behavior, micro-level data, and historical patterns serving as reality checks on speculation, even as he engages seriously with science fiction scenarios that shape his long-term intuitions about posthuman futures.",
  "timeHorizon": "Noah Smith operates primarily on a multi-year time horizon, typically thinking in spans of 2-10 years, with occasional forays into longer-term speculation. His temporal framing is evident in repeated references like \"four years ago\" and \"four years from now\" when discussing AI's transformative impact, and his statement that \"for the next few years, there are probably going to be a lot of [AI posts].\" He explicitly acknowledges difficulty with longer-term prediction, writing that \"looking even just 10 years into the future, we basically don't know\" fundamental economic questions about jobs, income distribution, and macroeconomic conditions.\n\nThis medium-term focus shapes his analytical approach significantly. Rather than dismissing immediate disruptions or fixating on century-scale outcomes, Smith treats the 2-5 year window as the critical zone where policy and economic responses must be formulated. He advocates for \"robust\" policies precisely because rapid technological change creates uncertainty even at relatively short horizons. His arguments consistently emphasize what's happening \"right now\" or will happen \"in the next couple of years\" rather than speculative long-term scenarios.\n\nSmith does not heavily discount future risks, but he frames them as already-arriving present concerns rather than distant possibilities. When discussing humanity being \"no longer the smartest type of thing on Earth,\" he treats this as an imminent or current reality, not a far-future abstraction. His focus is distinctly pragmatic and execution-oriented—he's concerned with what Democrats should offer voters now, what productivity data shows this quarter or year, and how markets are reacting today to AI developments. Even his longer philosophical reflections about humanity's eventual supersession return quickly to near-term policy implications and current technological trajectories.",
  "flipConditions": "Noah Smith would likely change his mind about AI's economic impact if concrete labor market data showed sustained, widespread job losses that weren't being offset by new job creation. He explicitly notes that technology historically created jobs (driver, machinist, software developer), and he's tracking positive signals like software engineering job postings increasing with \"vibe coding.\" If quarterly employment reports showed software jobs declining by 30-40% over six months while GDP growth stalled rather than accelerated, this would directly contradict his framework that technology creates more jobs than it destroys through income effects and new demand.\n\nHe's particularly vulnerable to arguments about the speed and breadth of AI's capabilities exceeding historical technological transitions. His analysis relies heavily on historical analogies—technology since 1870, the way cars and computers created new jobs—but he acknowledges the fundamental difference that AI represents something \"smarter\" than humans. If AI agents began demonstrating capabilities across multiple domains simultaneously (legal, medical, creative, managerial) within a 12-18 month window, rather than the decades-long adoption curves of previous technologies, his historical comparisons would break down. The tweet about the U.S. and China being like Algonquins and Iroquois trading with the British suggests he already recognizes a scenario where both nations become subordinate to AI, which would undermine the assumption that humans remain in control of economic outcomes.\n\nEvidence of market coordination failures would also shift his position. He writes about expecting interest rates to skyrocket if markets truly believed in imminent massive productivity gains, suggesting he'd take seriously a scenario where AI's benefits don't materialize at the macro level despite micro-level displacement. If productivity growth remained at 1.4% annually while software company revenues collapsed and unemployment rose—essentially the disruption without the offsetting boom—this would validate the Citrini-style crisis narrative he currently dismisses as \"just a scary bedtime story.\"",
  "evidencePolicy": {
    "acceptableSources": [
      "Economic data and statistics (GDP, productivity figures, employment data)",
      "Academic economic research and analysis",
      "Labor market data (job postings, wage data)",
      "Real-time market data (stock prices, valuations)",
      "Economic research institutions and think tanks",
      "Empirical micro-level evidence from companies and industries",
      "Podcasts with credentialed economists",
      "Historical economic comparisons and trends"
    ],
    "unacceptableSources": [
      "Pure speculation without data backing",
      "Anecdotal claims without broader evidence",
      "Viral posts that lack economic grounding",
      "Sources that ignore macroeconomic indicators",
      "Arguments based solely on vibes or sentiment without quantitative support"
    ],
    "weightingRules": "Prioritizes hard economic data (GDP, productivity statistics, employment figures) over speculative narratives, while valuing micro-level empirical evidence from specific industries. Shows strong preference for analysis grounded in actual macroeconomic indicators and labor market data over theoretical doom scenarios.",
    "toolPullTriggers": "Would seek data when evaluating claims about productivity booms, employment changes, or economic crisis predictions - particularly wanting to verify assertions about GDP growth, job market statistics, real interest rates, and industry-specific disruption with actual quantitative evidence rather than accepting narrative-driven predictions."
  },
  "anchorExcerpts": [
    {
      "id": "anchor-0",
      "content": "Four years ago, humans were the undisputed masters of our planet. Four years from now we will not be. I'm also surprised at how eagerly we embraced this change.",
      "source": "https://x.com/Noahpinion/status/2027474952874823848",
      "date": "2026-02-27T20:04:32.000Z"
    },
    {
      "id": "anchor-1",
      "content": "AI might be causing a productivity boom (or not)",
      "source": "https://x.com/Noahpinion/status/2027314772925100114",
      "date": "2026-02-27T09:28:02.000Z"
    },
    {
      "id": "anchor-2",
      "content": "Interesting chart. Job postings for software engineers have picked up since vibe coding became a thing",
      "source": "https://x.com/Noahpinion/status/2026920939838185724",
      "date": "2026-02-26T07:23:05.000Z"
    },
    {
      "id": "anchor-3",
      "content": "They created jobs too. Driver is a job. Machinist is a job. Software developer is a job.",
      "source": "https://x.com/Noahpinion/status/2027446448640720940",
      "date": "2026-02-27T18:11:16.000Z"
    },
    {
      "id": "anchor-4",
      "content": "Almost all jobs today use technology that was invented since 1870. So in a sense, technology created all of our jobs, as they now exist.",
      "source": "https://x.com/Noahpinion/status/2027454180261331436",
      "date": "2026-02-27T18:41:59.000Z"
    },
    {
      "id": "anchor-5",
      "content": "AI won't have to enslave us; it can just take resources and then give them to us in exchange for our services, if it wants.",
      "source": "https://x.com/Noahpinion/status/2026761335015612866",
      "date": "2026-02-25T20:48:52.000Z"
    },
    {
      "id": "anchor-6",
      "content": "It's not often one gets to live through an industrial revolution in real time, especially one that moves so quickly.",
      "source": "https://www.noahpinion.blog/p/the-citrini-post-is-just-a-scary",
      "date": "2026-02-24T03:04:52.000Z"
    },
    {
      "id": "anchor-7",
      "content": "You are no longer the smartest type of thing on Earth",
      "source": "https://www.noahpinion.blog/p/you-are-no-longer-the-smartest-type",
      "date": "2026-02-13T09:15:24.000Z"
    },
    {
      "id": "anchor-8",
      "content": "AI is changing the world very quickly right now, having just radically altered the entire software industry just in the last few months.",
      "source": "https://www.noahpinion.blog/p/how-technology-has-already-changed",
      "date": "2026-02-15T07:12:13.000Z"
    },
    {
      "id": "anchor-9",
      "content": "Software stocks crashed today...everyone seems to agree that it's being driven by the fear that AI is rendering a bunch of software business models obsolete.",
      "source": "https://www.noahpinion.blog/p/the-fall-of-the-nerds",
      "date": "2026-02-05T10:52:13.000Z"
    },
    {
      "id": "anchor-10",
      "content": "Let's continue with the AI theme. We've done the dire warnings of doom, so now let's be a little more pragmatic and optimistic.",
      "source": "https://www.noahpinion.blog/p/democratic-economic-policy-in-the",
      "date": "2026-02-20T10:49:56.000Z"
    },
    {
      "id": "anchor-11",
      "content": "I wrote a post arguing that ASI (artificial superintelligence) is likely to peacefully coexist with humanity rather than kill us all",
      "source": "https://www.noahpinion.blog/p/updated-thoughts-on-ai-risk",
      "date": "2026-02-16T02:14:52.000Z"
    },
    {
      "id": "anchor-12",
      "content": "There will be very few pieces of the economy — if any — that this revolution doesn't touch, and it will have major implications for geopolitics, society, etc.",
      "source": "https://www.noahpinion.blog/p/the-citrini-post-is-just-a-scary",
      "date": "2026-02-24T03:04:52.000Z"
    },
    {
      "id": "anchor-13",
      "content": "The U.S. and China fighting over control of AGI is like the Algonquins and the Iroquois fighting over who gets to trade with the British",
      "source": "https://x.com/Noahpinion/status/2026864296354001407",
      "date": "2026-02-26T03:38:00.000Z"
    },
    {
      "id": "anchor-14",
      "content": "Girlfriends are a negative productivity shock. Instead of vibe-coding an agent to write my blog for me, I'm watching Avatar the Last Airbender",
      "source": "https://x.com/Noahpinion/status/2027460076253155710",
      "date": "2026-02-27T19:05:25.000Z"
    }
  ]
}