[
  {
    "id": "tweet-2027151367572173121",
    "content": "More from shareholder letter- \"I don't think we're early to this realization. I think most companies are late. Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes.\"",
    "source": "https://x.com/alapshah1/status/2027151367572173121",
    "date": "2026-02-26T22:38:43.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 14,
      "retweets": 0,
      "replies": 2
    }
  },
  {
    "id": "tweet-2027150758458585509",
    "content": "@matthew_pines Consider what this does to Block's competitive positioning assuming nothing breaks. They can afford to significantly lower prices and any competitor that doesn't follow them in drastic layoffs will end up in an impaired competitive position. Competitive dynamics dictate that https://t.co/xPxHzBUybi",
    "source": "https://x.com/alapshah1/status/2027150758458585509",
    "date": "2026-02-26T22:36:18.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 39,
      "retweets": 3,
      "replies": 5
    }
  },
  {
    "id": "tweet-2027141316526665869",
    "content": "Staggering news from @jack and Block today, proactively laying off 40% of the team. It’s a textbook example of the changes we are warning about in The Global Intelligence Crisis.\n\nWhile a 40% cut is devastating for those affected, it’s a cold look at the nature of AI’s progress: https://t.co/FZ26SikK8e",
    "source": "https://x.com/alapshah1/status/2027141316526665869",
    "date": "2026-02-26T21:58:46.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 143,
      "retweets": 17,
      "replies": 33
    }
  },
  {
    "id": "tweet-2026748392152682940",
    "content": "@buccocapital Isn't this actually the bear case for SOR incumbents? On signup customer is reassured that they own the data and can take it with them, but agent use means access to their data is restricted/upcharged. Now it makes a lot more sense to keep a second local copy of SOR data and",
    "source": "https://x.com/alapshah1/status/2026748392152682940",
    "date": "2026-02-25T19:57:26.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 24,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2026723752759722396",
    "content": "@krishnanrohit Co-author of Citrini post here. Curious how you setup each competitor and whether your model anticipated agent to restaurant direct transaction bc this is the real threat to each of these aggregators.\n\nRestaurants hate paying the DoorDash vig and will be thrilled to hand some of",
    "source": "https://x.com/alapshah1/status/2026723752759722396",
    "date": "2026-02-25T18:19:32.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 11,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2026422942180008077",
    "content": "@alexolegimas Agreed, it's an opportunity for many new businesses and business models to bloom if we get the policy right, gonna write about that a bit in the third piece in the series.",
    "source": "https://x.com/alapshah1/status/2026422942180008077",
    "date": "2026-02-24T22:24:13.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2026421032802988526",
    "content": "@Jason Co-author of the @Citrini7 piece here. We're not arguing you can vibe code a network effect. The argument is that when you tell ChatGPT \"order me a spicy tuna roll from Nobu,\" whoever owns that demand relationship can auction the fulfillment across DoorDash and other platforms,",
    "source": "https://x.com/alapshah1/status/2026421032802988526",
    "date": "2026-02-24T22:16:37.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 52,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2026418392337625497",
    "content": "@benthompson @PmQuant @Citrini7 Zero demand meaning no one is going to build it? Is the core of our disagreement that you don't think that ChatGPT, Gemini or Claude will create these demand auctions once they are aggregating sufficient demand? My thinking is that seamless lowest cost agentic transactions will",
    "source": "https://x.com/alapshah1/status/2026418392337625497",
    "date": "2026-02-24T22:06:08.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 9,
      "retweets": 0,
      "replies": 3
    }
  },
  {
    "id": "tweet-2026379925721329679",
    "content": "@benthompson @PmQuant I'm the co-author of the piece with @Citrini7 . Went through your piece today. We used DoorDash as an example because it's a large marketplace, but the real thought exercise is about what happens when today's phone app UI ordering moves to agentic AI ordering. In your aggregation",
    "source": "https://x.com/alapshah1/status/2026379925721329679",
    "date": "2026-02-24T19:33:17.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 22,
      "retweets": 4,
      "replies": 7
    }
  },
  {
    "id": "tweet-2026334638721909069",
    "content": "@Noahpinion Hey Noah, I’m Alap, co-author of the piece with @Citrini7 . I would urge you to start by reading part 1 of The Global Intelligence Crisis here https://t.co/M3ScsIb1Ov\n\nYou’re right nothing we are articulating is new news, the original part is linking the micro losses in specific",
    "source": "https://x.com/alapshah1/status/2026334638721909069",
    "date": "2026-02-24T16:33:20.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 38,
      "retweets": 3,
      "replies": 2
    }
  },
  {
    "id": "tweet-2026093838406746413",
    "content": "@eric_seufert I'm saying new startups won't own relationships with the end customer. They will work with restaurants and drivers and get their orders directly from ChatGPT and Gemini via their demand auctions. Among the biggest winners in this world will be restaurants themselves as they can",
    "source": "https://x.com/alapshah1/status/2026093838406746413",
    "date": "2026-02-24T00:36:28.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 22,
      "retweets": 1,
      "replies": 11
    }
  },
  {
    "id": "tweet-2026084420847804746",
    "content": "@mattdorta @Citrini7 Right but are you doing to trust the combination of Gemini and your fave pizza joint to do it well? \n\nOnce Gemini and ChatGPT have sufficient liquidity on both sides of their demand marketplace, the lowest cost  bidder to fulfill a slice of Joe's Pizza will always be Joe's Pizza.",
    "source": "https://x.com/alapshah1/status/2026084420847804746",
    "date": "2026-02-23T23:59:03.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 12,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2026080266788245668",
    "content": "@joecarlsonshow DoorDash's business is fine today, the issue lies with what happens when ChatGPT and Gemini start allowing users to simply prompt- \"order me a pepperoni pie from Joe's\"\n\nI'm Citrini's co-author on the report and lay out how that might go below\n\nhttps://t.co/cbEO9palUc",
    "source": "https://x.com/alapshah1/status/2026080266788245668",
    "date": "2026-02-23T23:42:33.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 24,
      "retweets": 0,
      "replies": 12
    }
  },
  {
    "id": "tweet-2026079098934587580",
    "content": "In the first part of the Global Intelligence Crisis series we lay out how agentic AI can drive white-collar job loss into an already weak labor market\n\nhttps://t.co/M3ScsIb1Ov",
    "source": "https://x.com/alapshah1/status/2026079098934587580",
    "date": "2026-02-23T23:37:54.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 18,
      "retweets": 1,
      "replies": 3
    }
  },
  {
    "id": "tweet-2026078154519916711",
    "content": "Across fiscal and monetary policy we should have sufficient control over aggregate demand, but the fed alone won't cut it.\n\nAlap here, co-author of the piece with Citrini. If 5% of white-collar jobs disappear and remaining workers retrench their spending in fear, how does cutting https://t.co/pyBuiAwNMi",
    "source": "https://x.com/alapshah1/status/2026078154519916711",
    "date": "2026-02-23T23:34:09.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 48,
      "retweets": 2,
      "replies": 5
    }
  },
  {
    "id": "tweet-2026072310277706152",
    "content": "@robfoot @Citrini7 I suspect these platforms might just be the big AI apps themselves. As they begin getting agentic demand from users to order a car or sushi, they will create demand auction marketplaces as I lay out in this DoorDash example. Restaurants will sign up to transact directly with",
    "source": "https://x.com/alapshah1/status/2026072310277706152",
    "date": "2026-02-23T23:10:56.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 2,
      "retweets": 0,
      "replies": 2
    }
  },
  {
    "id": "tweet-2026071486490915196",
    "content": "@ByrneHobart @Citrini7 In my experience most Uber drivers are also driving Lyft, so they gravitate to where the economics are best. I suspect that as the AI apps start executing transaction for their users, they will build their own demand auction marketplaces, plenty of drivers will sign up,",
    "source": "https://x.com/alapshah1/status/2026071486490915196",
    "date": "2026-02-23T23:07:39.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 5,
      "retweets": 0,
      "replies": 3
    }
  },
  {
    "id": "tweet-2026068780313350521",
    "content": "We detail the drivers of potential job losses in our first piece in the Global Intelligence Crisis series here\n\nhttps://t.co/M3ScsIb1Ov",
    "source": "https://x.com/alapshah1/status/2026068780313350521",
    "date": "2026-02-23T22:56:54.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 15,
      "retweets": 2,
      "replies": 4
    }
  },
  {
    "id": "tweet-2026068409721798878",
    "content": "AI productivity will ensure we have the wherewithal. But will have the political will to move fast enough?\n\nAlap here, co-author of the piece with @Citrini7 \n\nCovid offers two opposing lessons- a) we nailed the policy response (then overdid it w stimmy) bc our technology/ability https://t.co/IKJVtpGmjd",
    "source": "https://x.com/alapshah1/status/2026068409721798878",
    "date": "2026-02-23T22:55:26.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 30,
      "retweets": 2,
      "replies": 5
    }
  },
  {
    "id": "tweet-2026065792719061214",
    "content": "To replicate marketplaces like $DASH or $AXP you need to replicate the demand and supply side. AI apps will do the demand side work for you, so to compete w DoorDash you just need to build the driver and restaurant network. The biggest competitor will likely be direct restaurant https://t.co/WmUKDjoX1g",
    "source": "https://x.com/alapshah1/status/2026065792719061214",
    "date": "2026-02-23T22:45:02.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 282,
      "retweets": 24,
      "replies": 80
    }
  },
  {
    "id": "tweet-2026052287789994220",
    "content": "Even a 5% displacement of white-collar workers would have a huge knock-on effect\n\nhttps://t.co/M3ScsIb1Ov",
    "source": "https://x.com/alapshah1/status/2026052287789994220",
    "date": "2026-02-23T21:51:22.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 8,
      "retweets": 1,
      "replies": 5
    }
  },
  {
    "id": "tweet-2026052057363333133",
    "content": "Alap here, coauthor of the piece w @Citrini7.  Thought exercise is exactly the intent and happy to see we're getting the conversation going.\n\nWe're all collectively banking on labor reallocation but to where? White-collar work outside government supported sectors has been https://t.co/pFBsEI2sDh",
    "source": "https://x.com/alapshah1/status/2026052057363333133",
    "date": "2026-02-23T21:50:27.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 31,
      "retweets": 4,
      "replies": 3
    }
  },
  {
    "id": "tweet-2026042646288814230",
    "content": "We detail our use of agents today and think through how this will impact the overall labor market with our first piece in the Global Intelligence Crisis\n\nhttps://t.co/M3ScsIb1Ov",
    "source": "https://x.com/alapshah1/status/2026042646288814230",
    "date": "2026-02-23T21:13:03.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 19,
      "retweets": 1,
      "replies": 1
    }
  },
  {
    "id": "tweet-2026027388446896213",
    "content": "Alap here, co-author of the piece w @Citrini7 \n\nWe didn't have time to go through specifics in the piece, but what happens when you can ask Gemini or ChatGPT to order you a car or ramen? Let's say it's 2028 and 40% of the orders are via agent. ChatGPT can farm this out to lowest https://t.co/ViRRDVOMRJ https://t.co/UrzzZI5Z2K",
    "source": "https://x.com/alapshah1/status/2026027388446896213",
    "date": "2026-02-23T20:12:25.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 417,
      "retweets": 24,
      "replies": 108
    }
  },
  {
    "id": "tweet-2026022455022698529",
    "content": "Our first piece in the Global Intelligence Crisis series details the agents vs humans tradeoff\n\nhttps://t.co/M3ScsIb1Ov",
    "source": "https://x.com/alapshah1/status/2026022455022698529",
    "date": "2026-02-23T19:52:49.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 2,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2026021855115497694",
    "content": "Interesting point, I had never thought about compute supply in units of human intelligence equivalents.\n\nAlap here- co-authored the piece with @Citrini7\n\nGemini seems to think we will have compute equal to 3.3B devs by 2028 https://t.co/P6dOkwEykS https://t.co/u0GJIn7o5V",
    "source": "https://x.com/alapshah1/status/2026021855115497694",
    "date": "2026-02-23T19:50:26.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 53,
      "retweets": 2,
      "replies": 10
    }
  },
  {
    "id": "tweet-2026016122307223822",
    "content": "We detail our current use of agents and think through what happens to the economy when corporates catch up\n\nhttps://t.co/M3ScsIb1Ov",
    "source": "https://x.com/alapshah1/status/2026016122307223822",
    "date": "2026-02-23T19:27:39.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 6,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2026010298109608382",
    "content": "Our economy hasn't produced any white-collar jobs in 3 years\n\nAlap here, co-authored the piece with @Citrini. To your point Dean: the link is the displacement. When AI causes even 5% displacement, workers are forced into a shrinking pool, driving marginal wages down across the https://t.co/YxVAXZWF52",
    "source": "https://x.com/alapshah1/status/2026010298109608382",
    "date": "2026-02-23T19:04:31.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 180,
      "retweets": 8,
      "replies": 16
    }
  },
  {
    "id": "tweet-2025781039449219440",
    "content": "AI is humanity's Promethean moment- fire, stolen at last from the gods. Burning through jobs, this fire will cause a financial conflagration. We collectively possess the water and sand to tame this fire, but we must act swiftly to begin an urgent society-wide policy dialogue. https://t.co/rzNxiUXzRU",
    "source": "https://x.com/alapshah1/status/2025781039449219440",
    "date": "2026-02-23T03:53:31.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 488,
      "retweets": 92,
      "replies": 41
    }
  },
  {
    "id": "substack-0",
    "content": "Introduction After years of exponential growth, the recent capability jump to agentic AI is set to upend the world as we know it beginning in 2026. Here is the uncomfortable truth: AI is no longer just a tool for economic growth; it is a near-direct substitute for human cognitive labor. In the near term, it will displace white-collar workers far faster than new markets can absorb them. In this three-part series, I draw on 20 years of experience investing in public markets and 15 years building AI companies to outline my perspective on the coming economic storm. Our entire economic system is built on a single premise: human intelligence is a scarce, expensive resource. It is the key input required to turn raw materials into goods and services that dictate our living standards. In 2026, as agentic AI comes of age, that foundational assumption is collapsing. AI is no longer a mere tool or complement; it is rapidly becoming a direct substitute for human cognitive labor. This shift fundamentally devalues white-collar work. Fueled by surging AI progress and capital, this displacement will inexorably accelerate, creating an economic shock that could eclipse the Industrial Revolution, the Global Financial Crisis and the pandemic. Without urgent policy action, this has the potential to cause a significant financial crisis in the next two years. Thanks for reading! Subscribe for free to receive new posts and support my work. In Part One&#8211;The Rise of Agentic AI , I lay out the fundamental threat to jobs and our current economic model from agentic AI. In Part Two&#8211;The 2028 GLOBAL INTELLIGENCE CRISIS, A Thought Exercise in Financial History, from the Future , I have partnered with my friend Citrini to reason through how a crisis might play out. In the forthcoming Part Three&#8211;The Path Forward , I begin to lay out a sensible policy path through the crisis. My warning should not have you mistake me for an AI doomer. AI is humanity's Promethean moment &#8212; fire, st",
    "source": "https://alapshah1.substack.com/p/the-global-intelligence-crisis",
    "date": "2026-02-22T18:58:47.000Z",
    "platform": "substack"
  }
]