[
  {
    "id": "article-citrini-2028gic-intro",
    "content": "What if our AI bullishness continues to be right...and what if that's actually bearish? What follows is a scenario, not a prediction. This isn't bear porn or AI doomer fan-fiction. The sole intent of this piece is modeling a scenario that's been relatively underexplored. This is the CitriniResearch Macro Memo from June 2028, detailing the progression and fallout of the Global Intelligence Crisis. The unemployment rate printed 10.2% this morning, a 0.3% upside surprise. The market sold off 2% on the number, bringing the cumulative drawdown in the S&P to 38% from its October 2026 highs. Two years. That's all it took to get from 'contained' and 'sector-specific' to an economy that no longer resembles the one any of us grew up in.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-ghost-gdp",
    "content": "By October 2026, the S&P 500 flirted with 8000, the Nasdaq broke above 30k. The initial wave of layoffs due to human obsolescence began in early 2026, and they did exactly what layoffs are supposed to. Margins expanded, earnings beat, stocks rallied. Record-setting corporate profits were funneled right back into AI compute. Nominal GDP repeatedly printed mid-to-high single-digit annualized growth. Productivity was booming. Real output per hour rose at rates not seen since the 1950s, driven by AI agents that don't sleep, take sick days or require health insurance. The owners of compute saw their wealth explode as labor costs vanished. Meanwhile, real wage growth collapsed. Despite the administration's repeated boasts of record productivity, white-collar workers lost jobs to machines and were forced into lower-paying roles. When cracks began appearing in the consumer economy, economic pundits popularized the phrase 'Ghost GDP': output that shows up in the national accounts but never circulates through the real economy. In every way AI was exceeding expectations, and the market was AI. The only problem...the economy was not.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-feedback-loop",
    "content": "It should have been clear all along that a single GPU cluster in North Dakota generating the output previously attributed to 10,000 white-collar workers in midtown Manhattan is more economic pandemic than economic panacea. The velocity of money flatlined. The human-centric consumer economy, 70% of GDP at the time, withered. AI capabilities improved, companies needed fewer workers, white collar layoffs increased, displaced workers spent less, margin pressure pushed firms to invest more in AI, AI capabilities improved. It was a negative feedback loop with no natural brake. The human intelligence displacement spiral. White-collar workers saw their earnings power structurally impaired. Their incomes were the bedrock of the $13 trillion mortgage market—forcing underwriters to reassess whether prime mortgages are still money good.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-saas-disruption",
    "content": "In late 2025, agentic coding tools took a step function jump in capability. A competent developer working with Claude Code or Codex could now replicate the core functionality of a mid-market SaaS product in weeks. The mid-year review was the first time procurement teams were making decisions with visibility into what these systems could actually do. SaaS wasn't dead. There was still a cost-benefit-analysis to running and supporting in-house builds. But in-house was an option, and that factored into pricing negotiations. The competitive landscape had changed. AI had made it easier to develop and ship new features, so differentiation collapsed. Incumbents were in a race to the bottom on pricing. ServiceNow sold seats. When Fortune 500 clients cut 15% of their workforce, they cancelled 15% of their licenses. The same AI-driven headcount reductions that were boosting margins at their customers were mechanically destroying their own revenue base.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-reflexivity",
    "content": "The companies most threatened by AI became AI's most aggressive adopters. The historical disruption model said incumbents resist new technology, they lose share to nimble entrants and die slowly. That's what happened to Kodak, to Blockbuster, to BlackBerry. What happened in 2026 was different; the incumbents didn't resist because they couldn't afford to. With stocks down 40-60% and boards demanding answers, the AI-threatened companies did the only thing they could. Cut headcount, redeploy the savings into AI tools, use those tools to maintain output with lower costs. Each company's individual response was rational. The collective result was catastrophic. Every dollar saved on headcount flowed into AI capability that made the next round of job cuts possible. Software was only the opening act. The same logic that justified ServiceNow cutting headcount applied to every company with a white-collar cost structure.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-friction-zero",
    "content": "By early 2027, LLM usage had become default. Agentic commerce went from being a product story to a plumbing story. Commerce stopped being a series of discrete human decisions and became a continuous optimization process. Over the past fifty years, the U.S. economy built a giant rent-extraction layer on top of human limitations: things take time, patience runs out, brand familiarity substitutes for diligence. Trillions of dollars of enterprise value depended on those constraints persisting. Agents removed friction. Travel booking platforms were an early casualty. Insurance renewals, where the entire renewal model depended on policyholder inertia, were reformed. Real estate commissions compressed from 2.5-3% to under 1%. Machines optimizing for price and fit destroyed habitual intermediation. DoorDash's moat was literally 'you're hungry, you're lazy, this is the app on your home screen.' An agent doesn't have a home screen.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-payments-disruption",
    "content": "Once agents controlled the transaction, they went looking for bigger paperclips. The biggest way to repeatedly save the user money was to eliminate fees. In machine-to-machine commerce, the 2-3% card interchange rate became an obvious target. Agents went looking for faster and cheaper options than cards. Most settled on using stablecoins via Solana or Ethereum L2s, where settlement was near-instant and the transaction cost was measured in fractions of a penny. Mastercard's Q1 2027 report was the point of no return. American Express was hit hardest; a combined headwind from white-collar workforce reductions gutting its customer base and agents routing around interchange gutting its revenue model. Their moats were made of friction. And friction was going to zero.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-systemic-risk",
    "content": "The US economy is a white-collar services economy. White-collar workers represented 50% of employment and drove roughly 75% of discretionary consumer spending. The businesses and jobs that AI was chewing up were not tangential to the US economy, they were the US economy. 'Technological innovation destroys jobs and then creates even more'. This was the most popular and convincing counter-argument. It was popular and convincing because it'd been right for two centuries. Every new job, however, required a human to perform it. AI is now a general intelligence that improves at the very tasks humans would redeploy to. Displaced coders cannot simply move to 'AI management' because AI is already capable of that. For every new role AI created, it rendered dozens obsolete. The new roles paid a fraction of what the old ones did.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-displacement-spiral",
    "content": "Displaced white-collar workers did not sit idle. They downshifted. Many took lower-paying service sector and gig economy jobs, which increased labor supply in those segments and compressed wages there too. Overqualified labor flooding the service and gig economy pushed down wages for existing workers who were already struggling. Sector-specific disruption metastasized into economy-wide wage compression. Still employed professionals were spending like they might be next. Savings rates ticked higher and spending softened. The top 10% of earners account for more than 50% of all consumer spending in the United States. When these workers lost their jobs, or took 50% pay cuts to move into available roles, the consumption hit was enormous relative to the number of jobs lost. A 2% decline in white-collar employment translated to something like a 3-4% hit to discretionary consumer spending.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-no-natural-brake",
    "content": "AI got better and cheaper. Companies laid off workers, then used the savings to buy more AI capability, which let them lay off more workers. Displaced workers spent less. Companies that sell things to consumers sold fewer of them, weakened, and invested more in AI to protect margins. A feedback loop with no natural brake. The intuitive expectation was that falling aggregate demand would slow the AI buildout. It didn't, because this wasn't hyperscaler-style CapEx. It was OpEx substitution. A company that had been spending $100M a year on employees and $5M on AI now spent $70M on employees and $20M on AI. AI investment increased by multiples, but it occurred as a reduction in total operating costs. Every company's AI budget grew while its overall spending shrank. This cycle's cause was not cyclical.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-private-credit",
    "content": "Private credit had grown from under $1 trillion in 2015 to over $2.5 trillion by 2026. A meaningful share of that capital had been deployed into software and technology deals, many of them leveraged buyouts of SaaS companies at valuations that assumed mid-teens revenue growth in perpetuity. Software-backed loans began defaulting in Q3 2027. Zendesk was the smoking gun. In 2022, Hellman and Friedman and Permira had taken Zendesk private for $10.2 billion. The Annualized Recurring Revenue the loan was underwritten against was no longer recurring, it was just revenue that hadn't left yet. The largest ARR-backed loan in history became the largest private credit software default in history. The 'permanent capital' that was supposed to make the system resilient was the savings of American households structured as annuities invested in the same PE-backed software paper that was now defaulting.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-mortgage-crisis",
    "content": "The US residential mortgage market is approximately $13 trillion. Mortgage underwriting is built on the fundamental assumption that the borrower will remain employed at roughly their current income level for the duration of the loan. The white-collar employment crisis has threatened this assumption with a sustained shift in income expectations. Every prior mortgage crisis in US history has been driven by speculative excess, interest rate shocks, or localized economic shocks. None of these apply here. The borrowers in question are 780 FICO scores. They put 20% down. In 2008, the loans were bad on day one. In 2028, the loans were good on day one. The world just changed after the loans were written. People borrowed against a future they can no longer afford to believe in. Falling home prices are manageable when the marginal buyer is healthy. Here, the marginal buyer is dealing with the same income impairment.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-intelligence-premium",
    "content": "For the entirety of modern economic history, human intelligence has been the scarce input. Capital was abundant. Natural resources were finite but substitutable. Technology improved slowly enough that humans could adapt. Intelligence, the ability to analyze, decide, create, persuade, and coordinate, was the thing that could not be replicated at scale. Human intelligence derived its inherent premium from its scarcity. Every institution in our economy, from the labor market to the mortgage market to the tax code, was designed for a world in which that assumption held. We are now experiencing the unwind of that premium. Machine intelligence is now a competent and rapidly improving substitute for human intelligence across a growing range of tasks. The financial system, optimized over decades for a world of scarce human minds, is repricing. But repricing is not the same as collapse. The economy can find a new equilibrium. Whether we build new frameworks in time is the only question that matters.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "article-citrini-2028gic-policy-failure",
    "content": "The government needs to transfer more money to households at precisely the moment it is collecting less money from them in taxes. Federal receipts were running 12% below CBO baseline projections. Labor's share of GDP declined from 64% in 1974 to 56% in 2024. In the four years since AI began its exponential improvement, that has dropped to 46%. The sharpest decline on record. The traditional policy toolkit—rate cuts, QE—can address the financial engine but cannot address the real economy engine, because the real economy engine is not driven by tight financial conditions. It's driven by AI making human intelligence less scarce and less valuable. You can cut rates to zero and buy every MBS and all the defaulted software LBO debt in the market. It won't change the fact that a Claude agent can do the work of a $180,000 product manager for $200/month.",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T00:00:00.000Z",
    "platform": "substack"
  },
  {
    "id": "tweet-2027468973088854448",
    "content": "@xoxoxo538 Real",
    "source": "https://x.com/Citrini7/status/2027468973088854448",
    "date": "2026-02-27T19:40:46.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2027468907452195181",
    "content": "@joedab12 You see the chart right lol",
    "source": "https://x.com/Citrini7/status/2027468907452195181",
    "date": "2026-02-27T19:40:30.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 2,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2027396118368129099",
    "content": "@VKMacro Need to go back in time and slap the shit out of this naive mf \n\nhttps://t.co/v1dDcoLPsy",
    "source": "https://x.com/Citrini7/status/2027396118368129099",
    "date": "2026-02-27T14:51:16.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 16,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2027394680497819998",
    "content": "@SeanButta I sold it when it was like $25 😭",
    "source": "https://x.com/Citrini7/status/2027394680497819998",
    "date": "2026-02-27T14:45:33.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 14,
      "retweets": 0,
      "replies": 3
    }
  },
  {
    "id": "tweet-2027394404407754862",
    "content": "Could have just held this and bypassed the entire equity research arc smh https://t.co/KXTJjEZ8kg https://t.co/7zKzlkW5ih",
    "source": "https://x.com/Citrini7/status/2027394404407754862",
    "date": "2026-02-27T14:44:27.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 565,
      "retweets": 7,
      "replies": 29
    }
  },
  {
    "id": "tweet-2026754330129248257",
    "content": "We’ve removed the paywall on 26 Trades for 2026, our annual year ahead report that was published on December 17th, 2025. \n\nCheck it out!\n\nhttps://t.co/qOaOPRdaIA",
    "source": "https://x.com/Citrini7/status/2026754330129248257",
    "date": "2026-02-25T20:21:02.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1411,
      "retweets": 147,
      "replies": 51
    }
  },
  {
    "id": "tweet-2026538869605171604",
    "content": "@abaddonic2 @TexasOncologist 🙏",
    "source": "https://x.com/Citrini7/status/2026538869605171604",
    "date": "2026-02-25T06:04:52.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 6,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2025980800659792270",
    "content": "This is the first article I’ve ever written with the express hope that I am wrong. People discussing the topics raised, becoming more proactive and being aware of the risks inherent to what’s happening in technology is how that happens. \n\nI’m glad people are trying to prove or https://t.co/o3H56Ap5GP https://t.co/WZFKbE5O9c",
    "source": "https://x.com/Citrini7/status/2025980800659792270",
    "date": "2026-02-23T17:07:18.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1213,
      "retweets": 78,
      "replies": 156
    }
  },
  {
    "id": "tweet-2025980105458159676",
    "content": "@TheStalwart Have you looked at OWL since my last odd lots episode lol",
    "source": "https://x.com/Citrini7/status/2025980105458159676",
    "date": "2026-02-23T17:04:32.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 192,
      "retweets": 2,
      "replies": 6
    }
  },
  {
    "id": "tweet-2025978906142994478",
    "content": "Read this too! Alap is writing a piece about what we have to do to avoid the dystopian future laid out in the CitriniResearch article. https://t.co/nT5oX2lPB8",
    "source": "https://x.com/Citrini7/status/2025978906142994478",
    "date": "2026-02-23T16:59:46.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 669,
      "retweets": 49,
      "replies": 27
    }
  },
  {
    "id": "tweet-2025742247333925335",
    "content": "@darran0x It’s okay, Darran, I have sinned against the bull market and they will crucify me for it",
    "source": "https://x.com/Citrini7/status/2025742247333925335",
    "date": "2026-02-23T01:19:22.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 84,
      "retweets": 0,
      "replies": 7
    }
  },
  {
    "id": "tweet-2025741964860092747",
    "content": "in America, it’s illegal to think about bearish outcomes. even if you’ve been bullish for 3 years straight - consider a bearish scenario and you’re excommunicated from the twitterati https://t.co/a0dJqwLsWq",
    "source": "https://x.com/Citrini7/status/2025741964860092747",
    "date": "2026-02-23T01:18:15.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 2664,
      "retweets": 102,
      "replies": 144
    }
  },
  {
    "id": "tweet-2025736095955100043",
    "content": "@ShaleTier7 @firstadopter I thought you wrote a book Tae? Doesn’t that require knowing how to read? https://t.co/1mMiyuEAPS",
    "source": "https://x.com/Citrini7/status/2025736095955100043",
    "date": "2026-02-23T00:54:56.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 71,
      "retweets": 2,
      "replies": 10
    }
  },
  {
    "id": "tweet-2025714666060554617",
    "content": "@RhysSullivan Legitimately how the relationship between private equity / life insurers works, my friend…\n\nhttps://t.co/kwJp5JPi7F",
    "source": "https://x.com/Citrini7/status/2025714666060554617",
    "date": "2026-02-22T23:29:47.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 10,
      "retweets": 1,
      "replies": 2
    }
  },
  {
    "id": "tweet-2025713996569919709",
    "content": "@RhysSullivan You could always read the paragraph directly below it, and discover that the entire point was user adoption and distribution as a moat reducing due to agentic commerce? https://t.co/f1HUF07vLP",
    "source": "https://x.com/Citrini7/status/2025713996569919709",
    "date": "2026-02-22T23:27:07.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 299,
      "retweets": 1,
      "replies": 23
    }
  },
  {
    "id": "tweet-2025713032370762196",
    "content": "@dalibali2 thanks buddy",
    "source": "https://x.com/Citrini7/status/2025713032370762196",
    "date": "2026-02-22T23:23:17.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 19,
      "retweets": 0,
      "replies": 2
    }
  },
  {
    "id": "tweet-2025712921175621987",
    "content": "@Sleepysolcap Well I’m quite intellectually challenged so you have to factor that in to the time assumption",
    "source": "https://x.com/Citrini7/status/2025712921175621987",
    "date": "2026-02-22T23:22:50.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 448,
      "retweets": 1,
      "replies": 8
    }
  },
  {
    "id": "tweet-2025712242612687123",
    "content": "@skooookum I certainly was aggressive with the timeline (hoping it causes people to begin considering taking action sooner rather than later so we can avoid most of the worst)",
    "source": "https://x.com/Citrini7/status/2025712242612687123",
    "date": "2026-02-22T23:20:09.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 150,
      "retweets": 2,
      "replies": 11
    }
  },
  {
    "id": "tweet-2025711907022217573",
    "content": "@BlackScholesMan In the limit, marginally above electricity cost probably",
    "source": "https://x.com/Citrini7/status/2025711907022217573",
    "date": "2026-02-22T23:18:49.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 417,
      "retweets": 8,
      "replies": 20
    }
  },
  {
    "id": "tweet-2025697366884708710",
    "content": "@elevencapi @tszzl Can you elaborate",
    "source": "https://x.com/Citrini7/status/2025697366884708710",
    "date": "2026-02-22T22:21:02.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 2,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2025696102884720667",
    "content": "@TMTLongShort Agree with some of these points, I appreciate you adding to the conversation constructively.",
    "source": "https://x.com/Citrini7/status/2025696102884720667",
    "date": "2026-02-22T22:16:01.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 316,
      "retweets": 1,
      "replies": 5
    }
  },
  {
    "id": "tweet-2025695737133125939",
    "content": "@tszzl COVID is a lot different than anything that happens gradually. You have a lot more examples of inadequate policy response than you have of rapid adequate policy response over the past 100 years.",
    "source": "https://x.com/Citrini7/status/2025695737133125939",
    "date": "2026-02-22T22:14:33.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 62,
      "retweets": 2,
      "replies": 2
    }
  },
  {
    "id": "tweet-2025677590267146695",
    "content": "@fejau_inc @SammyKoppelman @stevehou @alapshah1 Any disagreement with the points made is more than welcome. I have no pride in this being a correct prediction, just a well thought out scenario.",
    "source": "https://x.com/Citrini7/status/2025677590267146695",
    "date": "2026-02-22T21:02:27.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 15,
      "retweets": 0,
      "replies": 2
    }
  },
  {
    "id": "tweet-2025676397859983549",
    "content": "@anistotle_ No thanks!",
    "source": "https://x.com/Citrini7/status/2025676397859983549",
    "date": "2026-02-22T20:57:43.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 255,
      "retweets": 0,
      "replies": 8
    }
  },
  {
    "id": "tweet-2025675864390697186",
    "content": "@vi_taly_a The way we realize the alternative is by recognizing the risks in this article and addressing them proactively rather than after they blow up. If this piece starts a conversation that plays even a miniscule role in that happening, it’ll be great.",
    "source": "https://x.com/Citrini7/status/2025675864390697186",
    "date": "2026-02-22T20:55:35.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 553,
      "retweets": 7,
      "replies": 11
    }
  },
  {
    "id": "tweet-2025675271358095431",
    "content": "If you want to read a piece that lays out the best bull/base case scenario, you should go read “Technological Revolutions and Financial Capital” by Perez.\n\nThe book argues that every technological advancement follows the same framework as it relates to public markets. There’s an https://t.co/Xf88lpEMh1",
    "source": "https://x.com/Citrini7/status/2025675271358095431",
    "date": "2026-02-22T20:53:14.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1221,
      "retweets": 71,
      "replies": 44
    }
  },
  {
    "id": "tweet-2025672657203581022",
    "content": "@dahu7744 @SammyKoppelman @stevehou @alapshah1 There are some mentions in there, but that’s an entirely different piece and yeah I think AI will progress faster and surprise more than physical AI over the next 3 years.",
    "source": "https://x.com/Citrini7/status/2025672657203581022",
    "date": "2026-02-22T20:42:51.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 5,
      "retweets": 0,
      "replies": 6
    }
  },
  {
    "id": "tweet-2025671677242220954",
    "content": "@altradescharts Thank you!",
    "source": "https://x.com/Citrini7/status/2025671677242220954",
    "date": "2026-02-22T20:38:57.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 12,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2025671608912773561",
    "content": "@stockjamz Just for the record my portfolio is +90% net long right now lol",
    "source": "https://x.com/Citrini7/status/2025671608912773561",
    "date": "2026-02-22T20:38:41.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 166,
      "retweets": 3,
      "replies": 7
    }
  },
  {
    "id": "tweet-2025671192506401135",
    "content": "@highyield6 Thank you man, I know plenty of people will shit on this because it makes them uncomfortable. Genuinely appreciate the positive feedback.",
    "source": "https://x.com/Citrini7/status/2025671192506401135",
    "date": "2026-02-22T20:37:02.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 221,
      "retweets": 1,
      "replies": 6
    }
  },
  {
    "id": "tweet-2025670636509462907",
    "content": "@SammyKoppelman @stevehou @alapshah1 People will call this bear porn. Some won’t like the way it’s written or how it’s framed. Others will ignore it entirely. That’s fine, but I can guarantee you that there are ideas in here that you haven’t considered before. For many of you, they will be valuable.",
    "source": "https://x.com/Citrini7/status/2025670636509462907",
    "date": "2026-02-22T20:34:49.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 732,
      "retweets": 19,
      "replies": 57
    }
  },
  {
    "id": "tweet-2025670146816139520",
    "content": "@anistotle_ @andimgladofit I’m sure your writing is much better, thanks for the feedback.",
    "source": "https://x.com/Citrini7/status/2025670146816139520",
    "date": "2026-02-22T20:32:52.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 5,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2025669941307818108",
    "content": "@anistotle_ It’s definitely not written by AI, but maybe that says something about what’s been reinforced as positive in the models when it comes to writing. Going to be interesting to have to deal with this kind of thing as a writer.",
    "source": "https://x.com/Citrini7/status/2025669941307818108",
    "date": "2026-02-22T20:32:03.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 155,
      "retweets": 0,
      "replies": 11
    }
  },
  {
    "id": "tweet-2025668648270967050",
    "content": "@cryptoklotz I would also love if someone wrote a refutation. That’s why I published it - to start a conversation.",
    "source": "https://x.com/Citrini7/status/2025668648270967050",
    "date": "2026-02-22T20:26:55.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 321,
      "retweets": 0,
      "replies": 27
    }
  },
  {
    "id": "tweet-2025668402795131105",
    "content": "Have to give some shout outs, as well, to the people who helped.\n\n@SammyKoppelman was an excellent editor and proofreader.\n\n@stevehou was very helpful double checking me on the macro analysis.\n\n@alapshah1 was the first person to pose the question and had many of the ideas that",
    "source": "https://x.com/Citrini7/status/2025668402795131105",
    "date": "2026-02-22T20:25:56.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 504,
      "retweets": 15,
      "replies": 12
    }
  },
  {
    "id": "tweet-2025668400396349476",
    "content": "I spent 100 hours over the past week researching, writing and editing the piece we just put out.\n\nIt’s a scenario, not a prediction like most of our work. But it was rigorously constructed, dismissing it outright requires the kind of intellectual laziness that tends to get",
    "source": "https://x.com/Citrini7/status/2025668400396349476",
    "date": "2026-02-22T20:25:56.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 14484,
      "retweets": 2346,
      "replies": 897
    }
  },
  {
    "id": "tweet-2025653614430023864",
    "content": "JUNE 2028. \n\nThe S&amp;P is down 38% from its highs. Unemployment just printed 10.2%. Private credit is unraveling. Prime mortgages are cracking. AI didn’t disappoint. It exceeded every expectation.\n\nWhat happened?​​​​​​​​​​​​​​​​\n\nhttps://t.co/JzzwCrbJgS",
    "source": "https://x.com/Citrini7/status/2025653614430023864",
    "date": "2026-02-22T19:27:11.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 27795,
      "retweets": 4270,
      "replies": 1870
    }
  },
  {
    "id": "tweet-2025383244540076373",
    "content": "@feinht This is the Q1 magnum opus",
    "source": "https://x.com/Citrini7/status/2025383244540076373",
    "date": "2026-02-22T01:32:49.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 8,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2025352029535641860",
    "content": "At the point in the editing process where I am just deleting words in sentences only to decide I liked it better the first way and putting them back so yeah, article out tmrw. https://t.co/TYgWW3fjWW",
    "source": "https://x.com/Citrini7/status/2025352029535641860",
    "date": "2026-02-21T23:28:47.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 347,
      "retweets": 2,
      "replies": 19
    }
  },
  {
    "id": "tweet-2024979689651970299",
    "content": "Since our bullish call on Korea last August…\n\nEWY +99.27%\nSPY +7.78%\n\nMoney counting time. https://t.co/EKTw9HANNh https://t.co/H0EON3L1JL",
    "source": "https://x.com/Citrini7/status/2024979689651970299",
    "date": "2026-02-20T22:49:14.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1223,
      "retweets": 47,
      "replies": 40
    }
  },
  {
    "id": "tweet-2024976385039892955",
    "content": "February 2026 government release summary:\n\nAliens &amp; Predators https://t.co/XEWchGNFdI",
    "source": "https://x.com/Citrini7/status/2024976385039892955",
    "date": "2026-02-20T22:36:07.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 228,
      "retweets": 10,
      "replies": 15
    }
  },
  {
    "id": "tweet-2024974454019780671",
    "content": "@SoftServedGummy @dreamtemple_ My friend, glory is earned, not purchased",
    "source": "https://x.com/Citrini7/status/2024974454019780671",
    "date": "2026-02-20T22:28:26.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 35,
      "retweets": 2,
      "replies": 3
    }
  },
  {
    "id": "tweet-2024972509733322998",
    "content": "New Citrini merch from @dreamtemple_ - whoever’s closest to the closing print of the 10 year yield next Friday gets the first one https://t.co/94TtWSe8JS",
    "source": "https://x.com/Citrini7/status/2024972509733322998",
    "date": "2026-02-20T22:20:43.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 250,
      "retweets": 5,
      "replies": 307
    }
  },
  {
    "id": "tweet-2024647167189610959",
    "content": "Makes me wonder how moo deng is doing https://t.co/AGQqFO2U0E",
    "source": "https://x.com/Citrini7/status/2024647167189610959",
    "date": "2026-02-20T00:47:55.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 264,
      "retweets": 9,
      "replies": 16
    }
  },
  {
    "id": "tweet-2024571550931046553",
    "content": "Evergreen.\n\nhttps://t.co/Rk75SWcwC3",
    "source": "https://x.com/Citrini7/status/2024571550931046553",
    "date": "2026-02-19T19:47:27.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 111,
      "retweets": 6,
      "replies": 3
    }
  },
  {
    "id": "tweet-2024548380936933591",
    "content": "Have a real spicy free article coming out this weekend.",
    "source": "https://x.com/Citrini7/status/2024548380936933591",
    "date": "2026-02-19T18:15:22.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 459,
      "retweets": 2,
      "replies": 24
    }
  },
  {
    "id": "tweet-2024546632633614602",
    "content": "“We’ve always been saying we feel really good about the quality of our portfolio and the quality of our marks, but just saying it in some ways doesn’t seem to have done enough.” https://t.co/0gUUHYwpEe",
    "source": "https://x.com/Citrini7/status/2024546632633614602",
    "date": "2026-02-19T18:08:26.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 279,
      "retweets": 5,
      "replies": 7
    }
  },
  {
    "id": "tweet-2023905392858726795",
    "content": "@KawaDono Mission Objective: Use the directed energy weapon mounted to your sub-sea vehicle to retrieve the 512kb DRAM stick being hidden in a TI-84 by insurgent forces.",
    "source": "https://x.com/Citrini7/status/2023905392858726795",
    "date": "2026-02-17T23:40:22.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 13,
      "retweets": 0,
      "replies": 2
    }
  },
  {
    "id": "tweet-2023904727713395044",
    "content": "@Native_0x Well now they will, oops.",
    "source": "https://x.com/Citrini7/status/2023904727713395044",
    "date": "2026-02-17T23:37:44.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 12,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2023904651444183072",
    "content": "“An Inconvenient Truth” but make it Gen Z https://t.co/U5QHaVCXyK",
    "source": "https://x.com/Citrini7/status/2023904651444183072",
    "date": "2026-02-17T23:37:25.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 152,
      "retweets": 11,
      "replies": 9
    }
  },
  {
    "id": "tweet-2023904175696888175",
    "content": "If we use this image for our Modern Warfare update tomorrow do you think we’ll get a cease and desist letter from Activision? https://t.co/blqotZf3AE",
    "source": "https://x.com/Citrini7/status/2023904175696888175",
    "date": "2026-02-17T23:35:32.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 181,
      "retweets": 2,
      "replies": 26
    }
  },
  {
    "id": "tweet-2023577096316915848",
    "content": "Gong xi fa cai https://t.co/b6HDCWInrS",
    "source": "https://x.com/Citrini7/status/2023577096316915848",
    "date": "2026-02-17T01:55:50.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 318,
      "retweets": 10,
      "replies": 11
    }
  },
  {
    "id": "tweet-2023576329300357191",
    "content": "Seedance kind of represents to me the first time that a Chinese AI product is just better definitively than a western product.\n\nWith DeepSeek is was mostly “this is close on performance BUT it is open source”.\n\nPerhaps Manus briefly was the best agentic product but that was",
    "source": "https://x.com/Citrini7/status/2023576329300357191",
    "date": "2026-02-17T01:52:47.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 877,
      "retweets": 45,
      "replies": 47
    }
  },
  {
    "id": "tweet-2023567650849255834",
    "content": "@sidprabhu In RAM terms, the S&amp;P500 is actually down 90% this year.",
    "source": "https://x.com/Citrini7/status/2023567650849255834",
    "date": "2026-02-17T01:18:18.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 322,
      "retweets": 14,
      "replies": 7
    }
  },
  {
    "id": "tweet-2023566999012405435",
    "content": "I used to struggle a lot with finding stocks that were optically expensive, I could bridge them in the bull case to actually being cheap on future numbers but I could never get comfortable enough to buy them. The best way to overcome that, I’ve found, was to stop thinking in such https://t.co/ABYtXG86SM",
    "source": "https://x.com/Citrini7/status/2023566999012405435",
    "date": "2026-02-17T01:15:43.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 592,
      "retweets": 28,
      "replies": 17
    }
  },
  {
    "id": "tweet-2023565334272160201",
    "content": "@thepunditoor The valuation absolutely worries me. You can back out of the post I made on our AI basket’s YTD contributors (linked) how these are weighted. \n\nSo you just have to do some scenario analysis - what is the % probability that Minimax catches up to OpenAI or Anthropic?\n\nAt IPO",
    "source": "https://x.com/Citrini7/status/2023565334272160201",
    "date": "2026-02-17T01:09:06.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 115,
      "retweets": 1,
      "replies": 3
    }
  },
  {
    "id": "tweet-2023562672109744454",
    "content": "@blondesnmoney Lmao",
    "source": "https://x.com/Citrini7/status/2023562672109744454",
    "date": "2026-02-17T00:58:31.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 11,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2023562467482145028",
    "content": "@Nascent_Market Idk man, they are though.",
    "source": "https://x.com/Citrini7/status/2023562467482145028",
    "date": "2026-02-17T00:57:42.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 4,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2023562367234158726",
    "content": "@jnconkle @Oscar69969 There are many things under my control but forcing people paying for the product to pay attention to it is not one of them 😭",
    "source": "https://x.com/Citrini7/status/2023562367234158726",
    "date": "2026-02-17T00:57:18.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 3,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2023562075315011651",
    "content": "@jnconkle hell yeah brother 🤝",
    "source": "https://x.com/Citrini7/status/2023562075315011651",
    "date": "2026-02-17T00:56:09.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 7,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2023561782405787945",
    "content": "@Nascent_Market I have seen the robots in person (unitree, agibot &amp; xpeng) about 6 months ago and they were all at this level of capability.",
    "source": "https://x.com/Citrini7/status/2023561782405787945",
    "date": "2026-02-17T00:54:59.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 9,
      "retweets": 1,
      "replies": 5
    }
  },
  {
    "id": "tweet-2023459616688918971",
    "content": "If Chinese robots being crazy adept at kung fu is not enough to get the US to take robotics seriously idk what is. https://t.co/I2ruYdfXxt",
    "source": "https://x.com/Citrini7/status/2023459616688918971",
    "date": "2026-02-16T18:09:01.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 507,
      "retweets": 23,
      "replies": 44
    }
  },
  {
    "id": "tweet-2023228847865405553",
    "content": "Can anyone name a single example of something private equity has acquired and not made worse?",
    "source": "https://x.com/Citrini7/status/2023228847865405553",
    "date": "2026-02-16T02:52:01.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 715,
      "retweets": 26,
      "replies": 165
    }
  },
  {
    "id": "tweet-2023183639882944899",
    "content": "“RAMaggedon” https://t.co/W2RGw3jNzH",
    "source": "https://x.com/Citrini7/status/2023183639882944899",
    "date": "2026-02-15T23:52:23.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 532,
      "retweets": 45,
      "replies": 20
    }
  },
  {
    "id": "tweet-2023164467719147742",
    "content": "Isomorphic (private) and Insilico (public in HK) both seem legit and promising",
    "source": "https://x.com/Citrini7/status/2023164467719147742",
    "date": "2026-02-15T22:36:12.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 287,
      "retweets": 3,
      "replies": 13
    }
  },
  {
    "id": "tweet-2023164244460482697",
    "content": "Have been speaking a lot more with people doing applied AI/ML for medical research and honestly if we could cure cancer and get absolutely nothing else then all the capex spending will have been worth it",
    "source": "https://x.com/Citrini7/status/2023164244460482697",
    "date": "2026-02-15T22:35:19.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1023,
      "retweets": 34,
      "replies": 59
    }
  },
  {
    "id": "tweet-2023116885798113396",
    "content": "This was a great read https://t.co/YZGObsJeOp",
    "source": "https://x.com/Citrini7/status/2023116885798113396",
    "date": "2026-02-15T19:27:07.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 537,
      "retweets": 33,
      "replies": 7
    }
  },
  {
    "id": "tweet-2022839190967222506",
    "content": "@MinvstrD You’re dating women with ethics??",
    "source": "https://x.com/Citrini7/status/2022839190967222506",
    "date": "2026-02-15T01:03:40.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 54,
      "retweets": 0,
      "replies": 5
    }
  },
  {
    "id": "tweet-2022836774360236291",
    "content": "For Valentine’s Day, a tip: I know it seems economically wise to buy lab grown diamonds instead of natural. Don’t do it. \n\nI have no earthly idea how, but I’m confident the women will be able to tell. Not worth the risk, my fellow men.",
    "source": "https://x.com/Citrini7/status/2022836774360236291",
    "date": "2026-02-15T00:54:04.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 479,
      "retweets": 3,
      "replies": 85
    }
  },
  {
    "id": "tweet-2022836294942876157",
    "content": "@RufusTFireflyJr Did you not know that or are you just aggressively reply guying while being confidently wrong?",
    "source": "https://x.com/Citrini7/status/2022836294942876157",
    "date": "2026-02-15T00:52:09.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 31,
      "retweets": 0,
      "replies": 2
    }
  },
  {
    "id": "tweet-2022835752099348909",
    "content": "@ptuomov @RufusTFireflyJr He definitely did not hedge their yen bond issuance, Berkshire states they don’t use FX derivatives to hedge and view the equity stake as an economic hedge from the dividends. And the equity stake is in trading companies that regularly see earnings tailwinds from yen weakness. https://t.co/VcU3RtJK4l",
    "source": "https://x.com/Citrini7/status/2022835752099348909",
    "date": "2026-02-15T00:50:00.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 4,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2022832298517819768",
    "content": "@RufusTFireflyJr Locking in generationally low rates to fund an equity investment that has benefitted from unexpected growth/inflation seems like a win to me. Borrowing yen at low rates to invest in a company that sees higher earnings when yen depreciates. The yen debt makes them less exposed to",
    "source": "https://x.com/Citrini7/status/2022832298517819768",
    "date": "2026-02-15T00:36:17.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 60,
      "retweets": 3,
      "replies": 1
    }
  },
  {
    "id": "tweet-2022791536296001751",
    "content": "The best macro trade of the past 5 years was Warren buffet’s Japanese bond issuance imo. Got him short the currency, short rates all while he was long the equities (trading houses).",
    "source": "https://x.com/Citrini7/status/2022791536296001751",
    "date": "2026-02-14T21:54:18.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1025,
      "retweets": 37,
      "replies": 34
    }
  },
  {
    "id": "tweet-2022497975482687940",
    "content": "This is what AGI means to me https://t.co/z3kcS1bR7q",
    "source": "https://x.com/Citrini7/status/2022497975482687940",
    "date": "2026-02-14T02:27:48.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 824,
      "retweets": 20,
      "replies": 22
    }
  },
  {
    "id": "tweet-2022466790157099351",
    "content": "People said AI wouldn’t be able to create new things but without AI we would not have unlocked the entirely new level of unfathomable sadness we’re witnessing from the keep4o people that is “my AI boyfriend got deleted the day before Valentine’s”",
    "source": "https://x.com/Citrini7/status/2022466790157099351",
    "date": "2026-02-14T00:23:53.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 392,
      "retweets": 19,
      "replies": 24
    }
  },
  {
    "id": "tweet-2022462423769186386",
    "content": "@gfodor literally the opposite https://t.co/cBi9oC5jGE",
    "source": "https://x.com/Citrini7/status/2022462423769186386",
    "date": "2026-02-14T00:06:32.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 109,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2022378883467669852",
    "content": "@su_mo This guy gets it",
    "source": "https://x.com/Citrini7/status/2022378883467669852",
    "date": "2026-02-13T18:34:34.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 17,
      "retweets": 1,
      "replies": 3
    }
  },
  {
    "id": "tweet-2022365624538718495",
    "content": "@0xDegenerate Basically",
    "source": "https://x.com/Citrini7/status/2022365624538718495",
    "date": "2026-02-13T17:41:53.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 5,
      "retweets": 0,
      "replies": 4
    }
  },
  {
    "id": "tweet-2022344176063705558",
    "content": "@0xKNL__ Yeah I hope they got a lot of security",
    "source": "https://x.com/Citrini7/status/2022344176063705558",
    "date": "2026-02-13T16:16:39.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 11,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2022342525655433568",
    "content": "Insane things going on in certain corners of the internet https://t.co/BEs7fkaY6Y",
    "source": "https://x.com/Citrini7/status/2022342525655433568",
    "date": "2026-02-13T16:10:06.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 510,
      "retweets": 16,
      "replies": 28
    }
  },
  {
    "id": "tweet-2022287138075877871",
    "content": "Our Dynamic AI basket - an actively managed strategy we’ve published for 3 years - is at all time highs &amp; up 30% YTD.\n\nThe top 13 contributors make up most of that. While we’ve shared every move &amp; thesis with our subscribers, a quick breakdown of the sub-themes we’ve been https://t.co/7taOU7x3fn",
    "source": "https://x.com/Citrini7/status/2022287138075877871",
    "date": "2026-02-13T12:30:00.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 410,
      "retweets": 22,
      "replies": 14
    }
  },
  {
    "id": "tweet-2022193471201898845",
    "content": "@Heysup07 oh they’re still asleep for sure",
    "source": "https://x.com/Citrini7/status/2022193471201898845",
    "date": "2026-02-13T06:17:48.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 5,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2022190869399712183",
    "content": "@JamieFollese Yes the entire software sector went down 30% because of insider trading, how dumb of me.",
    "source": "https://x.com/Citrini7/status/2022190869399712183",
    "date": "2026-02-13T06:07:28.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 33,
      "retweets": 0,
      "replies": 13
    }
  },
  {
    "id": "tweet-2022190417668915217",
    "content": "@Heysup07 Idk who “they” are since we have been covering the Chinese AI ecosystem since back when Cambricon was CNY60/share and have printed on both of these foundational names. 🤷‍♂️",
    "source": "https://x.com/Citrini7/status/2022190417668915217",
    "date": "2026-02-13T06:05:40.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 45,
      "retweets": 1,
      "replies": 7
    }
  },
  {
    "id": "tweet-2022188060910477397",
    "content": "This logic just keeps working it’s crazy. https://t.co/NlVYi5OjKl https://t.co/Vp0MMx8SYj",
    "source": "https://x.com/Citrini7/status/2022188060910477397",
    "date": "2026-02-13T05:56:18.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 249,
      "retweets": 9,
      "replies": 10
    }
  },
  {
    "id": "tweet-2022187655891685597",
    "content": "@based16z He was so wise",
    "source": "https://x.com/Citrini7/status/2022187655891685597",
    "date": "2026-02-13T05:54:42.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 27,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "tweet-2022155663204569317",
    "content": "Long cell tower REITs short commercial/office REITs does kind of seem like a banger.",
    "source": "https://x.com/Citrini7/status/2022155663204569317",
    "date": "2026-02-13T03:47:34.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 387,
      "retweets": 10,
      "replies": 23
    }
  },
  {
    "id": "tweet-2022154381672820974",
    "content": "Free sell side title for whoever is writing the CHRW core thesis intact reaction:\n\n“CHRW Selloff: No RIME or Reason” https://t.co/3ZdyIArMll",
    "source": "https://x.com/Citrini7/status/2022154381672820974",
    "date": "2026-02-13T03:42:29.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 111,
      "retweets": 2,
      "replies": 8
    }
  },
  {
    "id": "tweet-2022153519558799417",
    "content": "@StevenMandrapa My bar for what constitutes a negative catalyst capable of derailing this has certainly risen a lot, at least, but I don’t think I am prepared to go full “this time is different”",
    "source": "https://x.com/Citrini7/status/2022153519558799417",
    "date": "2026-02-13T03:39:03.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 3,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2022153236900458512",
    "content": "Before anyone asks - yes, right now we are deeply into discounting the present in favor of the promise of the future. I don’t see anything happening right now as evidence of an obvious negative catalyst, but that can very quickly change.",
    "source": "https://x.com/Citrini7/status/2022153236900458512",
    "date": "2026-02-13T03:37:56.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 148,
      "retweets": 3,
      "replies": 5
    }
  },
  {
    "id": "tweet-2022151959290183829",
    "content": "@sidprabhu Yeah I mean for like 3 years my bio was “Soros Stan”",
    "source": "https://x.com/Citrini7/status/2022151959290183829",
    "date": "2026-02-13T03:32:51.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 47,
      "retweets": 1,
      "replies": 0
    }
  },
  {
    "id": "tweet-2022150778970845320",
    "content": "This is how I think about hype cycles in markets. It is basic, but that’s the point (frameworks shouldn’t be overly complex, I think).\n\nInvestors are always either discounting the promise of the future or the reality of the present. And they are never equally weighting them. https://t.co/QPw0RN0soh",
    "source": "https://x.com/Citrini7/status/2022150778970845320",
    "date": "2026-02-13T03:28:10.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 926,
      "retweets": 100,
      "replies": 38
    }
  },
  {
    "id": "tweet-2022124483264618722",
    "content": "Bears 2 months ago: “AI is a scam and a bubble”\n\nBears now: “AI is going to eat the world and everything needs to be repriced for this eventuality”",
    "source": "https://x.com/Citrini7/status/2022124483264618722",
    "date": "2026-02-13T01:43:40.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 1477,
      "retweets": 114,
      "replies": 77
    }
  },
  {
    "id": "tweet-2022121648145793063",
    "content": "Great now the AI agents are bitching on Internet forums. Truly, no human activity is safe. https://t.co/va6Ht4LiUK",
    "source": "https://x.com/Citrini7/status/2022121648145793063",
    "date": "2026-02-13T01:32:24.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 259,
      "retweets": 8,
      "replies": 10
    }
  },
  {
    "id": "tweet-2022071548946133011",
    "content": "@davidma Should have put my portfolio into the cubes https://t.co/pFoQJ6Zl8i",
    "source": "https://x.com/Citrini7/status/2022071548946133011",
    "date": "2026-02-12T22:13:20.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 117,
      "retweets": 0,
      "replies": 4
    }
  },
  {
    "id": "tweet-2022052342049505351",
    "content": "Bonds look kind of good again?! https://t.co/i1zUeyEpCD",
    "source": "https://x.com/Citrini7/status/2022052342049505351",
    "date": "2026-02-12T20:57:00.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 295,
      "retweets": 3,
      "replies": 43
    }
  },
  {
    "id": "tweet-2022032103622488089",
    "content": "@fabknowledge Let’s GO",
    "source": "https://x.com/Citrini7/status/2022032103622488089",
    "date": "2026-02-12T19:36:35.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 15,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2022030444238450922",
    "content": "@n0th0stl3tk0v3r Don’t you mean “let the hyper object at the end of the universe reaching backwards through time to assemble itself sort them out”",
    "source": "https://x.com/Citrini7/status/2022030444238450922",
    "date": "2026-02-12T19:30:00.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 27,
      "retweets": 0,
      "replies": 0
    }
  },
  {
    "id": "tweet-2022008888795746331",
    "content": "@BitcoinLifeboat I don’t think the stock you’ve mentioned is a “data center play” as much as it’s just a super high beta speculative bet that obviously gets creamed when sentiment inflects lower.",
    "source": "https://x.com/Citrini7/status/2022008888795746331",
    "date": "2026-02-12T18:04:20.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 32,
      "retweets": 0,
      "replies": 2
    }
  },
  {
    "id": "tweet-2022007316573565108",
    "content": "@algoflows Referring to CHRW price action today",
    "source": "https://x.com/Citrini7/status/2022007316573565108",
    "date": "2026-02-12T17:58:06.000Z",
    "platform": "twitter",
    "metrics": {
      "likes": 20,
      "retweets": 0,
      "replies": 1
    }
  },
  {
    "id": "substack-0",
    "content": "Preface What if our AI bullishness continues to be right...and what if that&#8217;s actually bearish? What follows is a scenario, not a prediction. This isn&#8217;t bear porn or AI doomer fan-fiction. The sole intent of this piece is modeling a scenario that&#8217;s been relatively underexplored. Our friend Alap Shah posed the question, and together we brainstormed the answer. We wrote this part, and he&#8217;s written two others you can find here . Hopefully, reading this leaves you more prepared for potential left tail risks as AI makes the economy increasingly weird. This is the CitriniResearch Macro Memo from June 2028, detailing the progression and fallout of the Global Intelligence Crisis. Macro Memo The Consequences of Abundant Intelligence CitriniResearch February 22nd, 2026 June 30th, 2028 The unemployment rate printed 10.2% this morning, a 0.3% upside surprise. The market sold off 2% on the number, bringing the cumulative drawdown in the S&amp;P to 38% from its October 2026 highs. Traders have grown numb. Six months ago, a print like this would have triggered a circuit breaker. Two years. That&#8217;s all it took to get from &#8220;contained&#8221; and &#8220;sector-specific&#8221; to an economy that no longer resembles the one any of us grew up in. This quarter&#8217;s macro memo is our attempt to reconstruct the sequence - a post-mortem on the pre-crisis economy. The euphoria was palpable. By October 2026, the S&amp;P 500 flirted with 8000, the Nasdaq broke above 30k. The initial wave of layoffs due to human obsolescence began in early 2026, and they did exactly what layoffs are supposed to. Margins expanded, earnings beat, stocks rallied. Record-setting corporate profits were funneled right back into AI compute. The headline numbers were still great. Nominal GDP repeatedly printed mid-to-high single-digit annualized growth. Productivity was booming. Real output per hour rose at rates not seen since the 1950s, driven by AI agents that don&#8217;t sleep, ",
    "source": "https://www.citriniresearch.com/p/2028gic",
    "date": "2026-02-22T19:22:00.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-1",
    "content": "Over the past year, we&#8217;ve spent more and more time following the developments of the defense industry as a key thematic trend. Our foray into the landscape was with the creation of a Drone basket in our 25 Trades for 2025 &#8211; a bit of a flier on the &#8220;Drones over New Jersey!&#8221; panic of late 2024. But sometimes it&#8217;s the simplest observations that actually work the best. The Drones basket turned out to be one of our best performing trade ideas of the year, turbocharged by a chaotic run of geopolitical events that emphasized the rapid evolution of asymmetric modern warfare, along with large jumps in global defense spending. Recognizing a strong theme emerging, we dug deeper into defense in the past year with The New WFH (War From Home) , and we continue to maintain an allocation to the theme in the Citrindex . For good reason. The theme spans multiple critical forces &#8211; all of which provide huge tailwinds. Evolving winners of &#8220;Fiscal Primary&#8221; favoring defense Disruptive technology with public market opportunity Geopolitical tailwinds in an increasingly fractured world These catalysts are only accelerating. While it is inevitable that most dollars of government spending will go to the major defense primes, our coverage has tended to focus on smaller enablers of &#8220;modern warfare&#8221; &#8211; that is, companies that provide more direct exposure to the trends with the highest pace of acceleration &#8211; autonomous systems (drones), modern weapons (lasers), and spectrum dominance (electronic warfare). And while it may not come off as the most sophisticated methodology, our &#8220;ripped-from-the-headline&#8221; approach continues to work out for us fairly well. For example, there was nothing secretive about the massive US naval buildout around Venezuela in late 2025, and it didn&#8217;t take a four star general to think that &#8220;regime change&#8221; was on the table. Simply noting the possibility of regime change and hig",
    "source": "https://www.citriniresearch.com/p/thematic-update-modern-warfare",
    "date": "2026-02-18T16:17:54.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-2",
    "content": "Introduction Capital is rotating out of bits and into atoms. Software companies, the darlings of the last decade, are being forced to answer a question they&#8217;ve never had to answer before: what happens to your 30x revenue multiple when new technology poses a potentially existential threat? See, for many of these companies, valuations were so high and such sustained growth was priced in that agentic AI didn&#8217;t even need to actually impact the business. The threat of a threat was enough to reprice them. Into this software selloff, anything that wasn&#8217;t nailed down was thrown overboard. Vertical SaaS, digital advertising platforms, portions of fintech, all suddenly trading at discounts to their historical ranges as the market begins to assign what I&#8217;d call an &#8220;AI Disruption Discount&#8221;. Does your high switching cost or sticky UX matter in the AI era? Don&#8217;t know? Okay - trade lower until you do. Will agentic commerce threaten your marketplace? Maybe? Okay, well, you&#8217;re worth 30% less. The logic is ruthless and correct: none of us really know what AI will look like in a few years, and the technology is advancing at a rate that has us asking if the singularity actually just got penciled in for next Thursday. Agentic AI was a talking point for investors, but once Anthropic et al. shoved it in their face they had to reconcile with some hard potential realities that didn&#8217;t align with their portfolio. We could spend a lot of time debating what moats will endure in software &#8211; do we just sell anything you click and buy the dip in the APIs? Is this just empowering new entrants to challenge incumbents or will enterprises bring entire software workflows in house via AI? The more you think about it, the more you realize that without a crystal ball you&#8217;ve got a lot more questions than answers. That&#8217;s why I think investors will opt for a simpler outlook - what can&#8217;t you prompt your way out of? The answer to this",
    "source": "https://www.citriniresearch.com/p/atoms-vs-bits",
    "date": "2026-02-11T20:36:34.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-3",
    "content": "Introduction There is a lot going on in AI and the semiconductor supply chain. Almost too much, it seems at times. The wild performance in the most prominent players has reinforced the supply/demand balance we described in the idea &#8220;Post-Traumatic Supply Disorder&#8221; from our 26 Trades for 2026 . Memory, storage, semicap, advanced packaging &#8211; these sectors have performed incredibly well over the past month. We&#8217;ve also been reminded of something we have known for a while. &#8220; While one has indeed so far been able to get away with an understanding that only goes GPU-deep in AI, I believe that will rapidly begin changing&#8230; In the meantime, generalists are left to keep up with a rapidly advancing technological landscape in semiconductors that can easily leave you behind... The shame in that is that it often robs you of the ability to truly understand what&#8217;s behind the whole picture while ensuring you&#8217;re properly positioned &#8211; a picture which will only become increasingly important when these narratives take hold in the real world. &#8221; - AI Phase Two , April 2025 In order to have caught the most asymmetric trades of the &#8220;AI Bubble&#8221;, you had to be paying attention to things that were a bit complex for a generalist. You also had to have a strong view on what would happen in the supply chain 6-12 months from now due to whatever was happening right now. Some bad news: it is not going to get any easier from here. We can&#8217;t sit idly by while the expected returns from mainstream &#8220;layups&#8221; like Nvidia, Micron, SK Hynix, Broadcom etc. moderate. That&#8217;s why we&#8217;ve hired some talented semiconductor analysts, so they can explain to us ignorant generalists what&#8217;s going on behind the Wall Street curtain (and we can then translate it back into thematic upside). Our two newest team members, Zephyr and Jukan , add deep semiconductor knowledge to Citrini&#8217;s existing thematic and trading exp",
    "source": "https://www.citriniresearch.com/p/semis-memo-muscle-memory",
    "date": "2026-01-26T13:23:41.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-4",
    "content": "The Upshot In this piece, we will cover: US Macro Reacceleration: AI productivity outweighs job cuts Pro-growth policy and fiscal impulse ahead of midterms Liquidity injections alleviate funding pressures Powell claps back Global Instability Breeds Opportunity : Long oil &amp; tankers Don-roe Doctrine winners China&#8217;s long march towards recovery And of course&#8230; Our New Macro Trades US Macro: Running Hot We find few reasons to be bearish on the US economy. The two biggest concerns of 2025 (tariffs and job creation) haven&#8217;t led to a broader slowdown. Rather, consumption and overall GDP data is accelerating, and while the labor market is stagnant, the floor remains intact. Productivity gains, in part driven by AI, are likely to increase. Meanwhile, the political pressure of midterm elections is already apparent in the White House, as Trump refocuses his attention towards everyday consumer concerns &#8211; inflation (oil supply), housing affordability (MBS buying), consumer credit (interest rate caps)-- even teasing direct stimulus checks. With 16 months passing since the first rate cut of this cycle in August 2024, perhaps we are beginning to see the &#8220;long-and-lagging&#8221; effects of bullish monetary policy beginning to materialize. Credit spreads remain tight, overall borrowing costs have decreased, and cyclical sectors like housing are beginning to show signs of life. The only real sand in the financial gears &#8211; increasingly stretched liquidity in funding markets which began to show up in late 2025 &#8211; has been cleaned out by the Fed&#8217;s new liquidity program. Whatever you want to call it, the Fed has officially crossed from base-money destruction to base-money creation and balance sheet expansion. The Year of AI Productivity While the U.S. labor market has significantly weakened in the past year, broader economic indicators tell a very different story. By nearly all measures, the US job market appears to have considerable slack, ",
    "source": "https://www.citriniresearch.com/p/macro-memo-running-hot",
    "date": "2026-01-14T01:09:47.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-5",
    "content": "Introduction Our Approach to the &#8220;Year Ahead Outlook&#8221;: It&#8217;s a bit of a ridiculous premise isn&#8217;t it, the &#8220;year ahead outlook&#8221;? Just because the number on the end of the calendar changes, you&#8217;re supposed to have a better idea of what happens over the next twelve months? I don&#8217;t know about you, but if I felt strongly that I knew what was going to happen over the next twelve months, I would not wait until December to share it. As speculators, we spend the majority of our time trying to be right about the future. That tends to be a good thing&#8212;efforts spent towards being right (or at least less wrong) tend to be rewarded. It doesn&#8217;t take a long or storied career as an investor to have numerous realizations that you&#8217;ve missed something very obvious in hindsight. Our vocational emphasis on accurate forecasting sometimes hurts us more than it helps. Becoming too in-the-weeds risks stifling the creative process that is a prerequisite to developing differentiated views. Once a year, we drop all pretense. Just for this exercise, our primary focus isn&#8217;t being right at the right time. Instead, we look at what&#8217;s occurred in the passing year and what might occur in the year ahead. Without any of the pressure surrounding &#8220;this has to happen or else I&#8217;m wrong,&#8221; we find that the ideas tend to more closely approximate the truly unpredictable nature of how things will unfold. Instead of an &#8220;outlook&#8221;, we create our Twenty-Something Trades. You can take a look at last year&#8217;s to get a better idea. The end result is a long list of ideas. Some we think could be real winners, some are preparation for a specific scenario or eventuality, some we simply want to keep on our screen. Our aim is to minimize the risk of intellectual blind spots. Are they all going to be good trades? Of course not, there&#8217;s 26 of them. Think of this as a thematic watchlist. The purpose of this article",
    "source": "https://www.citriniresearch.com/p/26-trades-for-2026",
    "date": "2025-12-17T13:03:05.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-6",
    "content": "The first words of our August State of the Themes AI section were direct: Long GOOGL. We elaborated&#8230; OpenAI is compute-constrained. Without their own datacenters or their own chips, they are at significant disadvantage to Google, which not only is an ascendant hyperscaler but also a chip designer that has designed the only mass produced chip competitive with Nvidia&#8217;s core offering across many metrics and has optimized their entire research, training and inference pipelines for it [...] Google has low customer acquisition costs, best-in-class first party data, full vertical integration and TPUs enabling cheaper training [...] It&#8217;s clear that both the technical and market tailwinds favor Google, but the market does not seem to be pricing that in. While the writing has been on the wall for some time, the market&#8217;s perception of Google has dramatically reversed over the past several months &#8211; transforming from an AI loser bleeding its search dominance to a stalking horse destined to undercut the most consensus AI winners. We can see this shift occurred around the time we wrote up Google (or, perhaps, around the time the legal overhang lessened) on this chart from Coatue: This sentiment has only accelerated in the past week with the release of Gemini 3. Not only is Google now firmly positioned at the cutting edge of frontier models, but it&#8217;s doing it on its own terms, or TPUs. It is indeed possible to train a frontier model without NVDA... that is, if you&#8217;re an ML-pioneering hyperscaler who has spent the past 10 years developing and optimizing for this custom silicon. The announcements that both Anthropic and Meta are planning to implement TPU chips raise further questions about NVDA&#8217;s dominance. Surprisingly, META reportedly wants TPUs for training, not just inference. None of this information is truly new (see above) but the one-two punch, combined with growing skepticism of OpenAI seems to have culminated in a passing of t",
    "source": "https://www.citriniresearch.com/p/carving-up-the-tpu",
    "date": "2025-11-27T15:01:59.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-7",
    "content": "The Upshot In our last Macro Memo , we expected: Slowing Without Breaking - labor market weakens but doesn&#8217;t collapse; further wage growth and rent inflation slowdown offsetting goods reflation. K-Shaped Economy Deepens - Lower-end consumer struggles (negative real wages, credit stress); wealthy cohort&#8217;s spending keeps aggregate consumption stable enough to avoid slowdown. China Tensions Peak Then Ease - Tit-for-tat escalation through October, then deal-making talk resumes with each seeking off-ramps amidst escalatory rhetoric. In a follow-up message on Substack, we further expressed high confidence that the US and China were highly motivated to quickly find a resolution to the export controls. Bull Market Continues - Not over; expect 5-10% pullback in near-term but significant upside remains longer-term. Fiscal Support Until Midterms - Trump administration will backstop markets/economy ahead of midterms with policy stimulus that will show up in 2026. For the next four weeks, we expect: The US job market continues to deteriorate based on private data. A deluge of post-shutdown economic data will unleash volatility over the next few weeks. End of government shutdown and QT to improve funding market liquidity. The Fed leaves the policy rate unchanged in December out of caution, STIR prices in more cuts to 2026. Risk-off sentiment continues to hit speculative areas, such as crypto, quantum and bitcoin miners, out to mid-December. We see a resolution of fears expected to lead to a Santa Rally as fiscal expansion is priced in for 2026. Before we get to our trades, a quick review of the economic developments since we last published&#8230; US Economy and Job Market How is the US economy doing? Because the federal government has been in a shutdown since Oct 1, we are missing many macro data points. In our last macro memo, for the US Economy and the Job Market section, we said &#8220; With the U.S. federal government shut down, last month&#8217;s public macroecon",
    "source": "https://www.citriniresearch.com/p/macro-memo-mo-vember",
    "date": "2025-11-17T11:50:58.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-8",
    "content": "Introduction Fifteen months ago, we initiated our Healthcare Innovation basket with a clear and (in our humble opinion) compelling long-term thesis: advances in medical technology and life sciences were on the brink of unleashing a super-cycle of more effective and efficient healthcare, and yet the market was overlooking the opportunity due to transient cyclical factors. But the situation quickly became complicated. Almost immediately following Election Day last year, we faced Markets Gone RF-Krazy as investors panicked about the new Trump administration&#8217;s healthcare policies and the potential impact on company fundamentals and valuations. At the time, we argued that this reaction was directionally incorrect and that the administration&#8217;s new policy agenda would ultimately prove highly supportive of our healthcare industry thesis. Since then, we&#8217;ve seen a see-saw of policy-induced freakouts and easing concerns &#8211; again ( January Musings ), again ( Healthcare&#8217;s AI-Powered Trump Card ), again ( Insuring Against Insanity ), again ( Talk to Me, Goose ), and again ( Rough Seas Make Strong Sailors ). Each time, we made the case for staying the course and used the volatility to increase our exposure to the theme. And if that was not contrarian enough, we focused our healthcare exposure on *gasp* small caps, the market&#8217;s ugliest step-children over the last several years. But this conviction has been rewarded, at least in the short-term, with various proxies for our thematic staging a sharp rebound and the basket itself handsomely outperforming those proxies. More than just a deadcat bounce, we think this the start of a multi-year industry upswing that leaves us more positive on the theme than ever before. In the pages that follow, we detail what we are watching and how we are positioning ourselves to best capitalize on this opportunity. Patient Status: Industry Health Improves, Investors Still Feel Sick Anyone invested in the healthcare spa",
    "source": "https://www.citriniresearch.com/p/i-can-see-clearly-now-the-rain-is",
    "date": "2025-11-03T12:55:34.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-9",
    "content": "Background Natural gas might not be as sexy as solving energy storage, or making GPUs more efficient, but it is the way we&#8217;re powering AI . AI eats electrons, electrons eat gas. We&#8217;ve focused quite a bit on power and electricity, but not so much on its source. There&#8217;s no way around it, if we want to power these data centers, we&#8217;re doing it with gas &#8211; at least for the foreseeable future. This incremental demand comes at a time when gas supply and demand balances were already becoming tighter with the consistent ramp of new LNG export facilities. This confluence of factors will ultimately result in natural gas prices moving structurally higher. For the past fifteen years, drillers from every corner of the United States have overwhelmed the natural gas markets with persistent supply growth. Most of this growth has been completely price insensitive. In shale&#8217;s infancy, capital markets rewarded production increases over cash flow. Then, associated gas (a by-product of oil-focused drilling) swamped an already oversupplied market. For well over a decade, gas has been plentiful and dirt cheap. This has led to a gross miscalibration of how much production growth drillers will deliver on a go-forward basis, and the price at which they&#8217;ll deliver it. As oil production from the Permian Basin begins to plateau, and we enter the final innings of the associated gas deluge; the US&#8217; natural gas supply stack becomes increasingly price sensitive and weighted towards dry gas (i.e. not oil-bearing) plays, where any incremental growth will require an economic return. This represents a shift in natural gas market dynamics. After a decade dominated by supply-push, the market will now be driven by a demand-pull. New demand growth in the US will be driven by two key factors (and the competition between them): Extraordinary new demand from LNG exports Extraordinary new demand for domestic electricity driven, in part, by the massive AI Data Cente",
    "source": "https://www.citriniresearch.com/p/power-struggle-natural-gas",
    "date": "2025-10-17T18:15:50.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-10",
    "content": "The Upshot Macro is a continual story. In raging bull markets, however, the psychology of investors treats each individual development as unique and unprecedented. It&#8217;s important to revisit some of the priors we have established: The cyclical economy and the lower income cohort of the U.S. economy has been doing poorly for some time. Haves vs Have Nots The secular economy, which represents a large portion of the market capitalization, is currently roughly halfway through a cycle of capex spending that sees no sign of slowing. This is the primary driver of equity returns on indices. Outside of this, the rest of the economy continues to look relatively precarious. Stargate The past two points, in combination, have resulted in a dynamic we refer to as the Macroeconomic Ouroboros. In this dynamic, the significantly skewed consumer spending volume made up by high net worth/high income households results in the K-shaped economy that is primarily driven by the wealth effect and equity prices. Macro Memo: After the Trump Bump Additionally, our house view at CitriniResearch has long been that we are deeply in the era of Fiscal Primacy . Regardless of the political party in charge of the White House, the US has embraced a populist bent since COVID that means government spending will backstop certain industries along partisan lines. Fiscal Primacy Because of this dynamic, as well as Fiscal Dominance (Fiscal driving monetary policy), we see an environment that means the administration will take whatever steps necessary to support the economy until midterm elections &#8211; where the house is hanging on by a thread for the Republicans. Whether through stimulus checks like the proposed &#8220;tariff refund&#8221; or the targeting of mortgage rates through lifting the cap on the amount of MBS the GSEs can hold, the administration will try to keep asset prices elevated for as long as possible. Macro Memo: Summer is Over Tariffs, as presented on April 2nd (which, obviously, ha",
    "source": "https://www.citriniresearch.com/p/macro-memo-red-october",
    "date": "2025-10-12T21:33:46.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-11",
    "content": "Sometimes, seeing is believing. CitriniResearch has been an early and vocal believer in the scale of the data center buildout necessary to implement and realize the full potential of Artificial Intelligence. In our inaugural AI primer, we dubbed Phase 1 of the AI Trade the &#8220;Global Data Center Hyper-Scaling&#8221; - a tongue-in-cheek reference to both the hyperscalers involved and the coming scale of the buildout. More than two years ago, we wrote: &#8220;The first phase [...] is centered around the development and build-out of robust computational infrastructure. This involves a massive and sustained tailwind to the suppliers of data center equipment of accelerated computing required for both AI training and inference&#8221; &#8220;The enormous computing power required for AI/ML places considerable demands on a variety of technology sectors. The companies involved in providing the necessary infrastructure stand to benefit significantly from this heightened demand. This includes businesses involved in semiconductor manufacturing, networking equipment, data center construction and management, and more.&#8221; Artificial Intelligence: Global Equity Beneficiaries (5/31/23) Since then, we&#8217;ve spent our time in front of our screens, watching green numbers climb higher across the supply chain involved in this massive effort. But there&#8217;s a risk of failing to appreciate it that is inherent to that; sometimes you just have to bear witness . Screens make it easy to forget the physical world behind the numbers. Chips don&#8217;t float. Fiber doesn&#8217;t spool itself. Power doesn&#8217;t magically appear at the edge of the rack. At some point, you have to step away from the chart and go stand where the megawatts meet the mud. So we went to Abilene, Texas. Or, at least, we sent a drone to Abilene, Texas with the help of investigative journalism firm Hunterbrook Media (who we partnered with on our Teradyne (TER) thesis ). Maybe I&#8217;m slow to the uptake but, ",
    "source": "https://www.citriniresearch.com/p/stargate-a-citrini-field-trip",
    "date": "2025-09-28T20:57:36.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-12",
    "content": "Identifying the most compelling themes in markets &#8211; what we have called &#8220;megatrends&#8221; &#8211; is the original raison d&#8217;etre of Citrini Research. The rise of artificial intelligence has been one of the most powerful and enduring themes of anything we have covered . Beginning with our original primer on the subject and continuing through our current coverage , we have tracked the evolution of the theme and the companies most likely to benefit. Indeed, in the course of our thematic research, we sometimes uncover an individual company so compelling - so well positioned to benefit from thematic tailwinds - that it warrants feature coverage. Given the transformational nature of the AI thematic, it is perhaps no surprise that most of our single stock ideas &#8211; from Celestica (CLS) to Credo Semiconductor (CRDO) to American Superconductor (AMSC) &#8211; have been based on the role each company plays in the AI infrastructure buildout. You can trace a pretty straight line through the progression of that buildout using our favorite longs. In 2023, we favored the heart of the server &#8211; names like Nvidia, Supermicro and Celestica &#8211; as the largest concern was getting more GPU servers to train AI models. Then, we favored names like Credo and Ciena, as the infrastructure required to connect servers and span distances inside the data centers became front and center for investors. More recently, we focused on names like American Superconductor and Siemens Energy, jumping out of the data center entirely towards products that manage the high voltage power requirements necessary to run them. Now, we ask, what about the new data centers? We&#8217;re not just putting a bunch of AI accelerators into existing facilities, ensuring they&#8217;ve got the connectivity and electricity to run and then calling it a day, are we? No. Regardless of inflation, a few trillion bucks over five years still buys you a bit more than that. The future is greenfield data ce",
    "source": "https://www.citriniresearch.com/p/single-stock-long-thesis",
    "date": "2025-09-18T14:08:40.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-13",
    "content": "The Upshot In this article, we review: US Economy and Job Market Long Bond Yields: Secular Meets Cyclical Tariff Revenue &amp; Bond Yields The Housing Unlock? The Trump Admin&#8217;s Plan for Mortgage Rates Macro Trades Ideas In our last Macro Memo , we predicted: The US economy and job market will continue to slow without breaking. [Yes] Overall inflation flat or lower despite tariff effects on goods prices. [Half Right] &#8220;The Powell Struggle&#8221; leads to fiscal - monetary convergence. Tariff uncertainty resolves [Half Right] The Fed to signal openness to rate cuts [Yes] Falling long yields to unlock housing market [Yes and N o] STIR markets price more cuts into the first year of Powell&#8217;s successor&#8217;s term versus out to the end of Powell&#8217;s term [Unch] Going forward, we expect: Cyclical economic slowdown and labor market weakness The Trump Admin to attempt to target lower mortgage rates utilizing GSE privatization and deregulation Self-fulfilling seasonally turbulent asset markets, equity volatility for the remainder of Q3 Increasing short-term inflation concerns Fed rate cut in September but uncertainty further out as Fed board composition hangs in balance The market is juggling between inflation and growth risks again. Over the last three years, it seems like we&#8217;ve experienced an inflation scare every other quarter interlaced with a growth scare in between. Maybe this is just the navigation of a soft landing, but the fact that the US stock market has been on a nonstop tear since the April bottom amplifies these risks during a seasonally volatile period. While we continue to believe the tariff-driven inflation to be short-lived, it doesn&#8217;t matter what eventually transpires if the market is worried about tariff-driven goods inflation, its second-order in services, and non-tariff factors driving a second round of inflation acceleration. Given these short run inflation concerns, a whiff of growth scare (like a weak jobs report), wi",
    "source": "https://www.citriniresearch.com/p/macro-memo-summer-is-over",
    "date": "2025-09-03T17:46:25.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-14",
    "content": "If you&#8217;re new to CitriniResearch, our State of the Themes is our chance to catch up on all the developments occurring across our coverage. While we try to actively trade around our themes, our State of the Themes articles outline longer term views, highlight new stocks and give readers a solid grasp on what&#8217;s moving and where. I can confidently say that 2025 has been one of the most thematically driven years in recent memory. Unlike 2024, which was mostly dominated by one theme (AI), this year has seen broad dispersion across trends. Sometimes a singular environment is easier &#8211; if there&#8217;s one dominant theme it&#8217;s much less likely you&#8217;ll miss out. We&#8217;ve caught our fair share so far this year &#8211; from drones/electronic warfare, to the EU defense trade, AI&#8217;s gyrations, and its embodied counterpart Robotics and the Trump trade&#8217;s various forms (from DOGE concerns to tariffs to the One Big Beautiful Bill). At the same time, these kinds of rapid-fire thematic markets make a &#8220;misfire&#8221; all the more likely. When trends shift around rapidly, shiny and fast moving things can present investors long-term promise when there&#8217;s none to be had. We recall not-so-fondly the thematic trades in 5G, IoT and Work-From-Home that burned investors despite becoming real parts of everyday life. Some recent &#8220;themes&#8221;, like the Digital Asset Treasury trade or Quantum Computing, give us a bit of pause as to where we are in the cycle. Our efforts are meant to focus on the most durable, investable and market-moving of these trends, but it&#8217;s important once in a while to step back and see what&#8217;s moving. So, let&#8217;s check in on the CitriniResearch thematic universe: In this quarter&#8217;s &#8220;State of the Themes&#8221; we will cover our continued allocation decisions in AI, Robotics, Healthcare, Defense and Government Policy . Additionally, we bring back a thematic basket we opted to exit in favor ",
    "source": "https://www.citriniresearch.com/p/state-of-the-themes",
    "date": "2025-08-18T22:29:39.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-15",
    "content": "In this piece, we provide an update on: US economy and job market Tariff and Inflation Risks Market correction and/or repeat of Dotcom Bubble &#8220;The Powell struggle&#8221;, rate cuts and housing unlock Bond yields and housing unlock and cyclical sectors US - China Talk Macro Positioning Our diagnoses and predictions have mostly borne out to be accurate: Tariff inflation risks were overstated [Yes] Services disinflation continues and overwhelms goods inflation [Yes] General US economic resilience with a softening labor market [Yes] The Fed makes good news insurance cuts [Not quite, yet.] US - China tension continues to take off-ramps [Yes] Rare earth and the importance of strategic leverage [Yes] European outperformance in FX &amp; Equities would taper off [No/Not yet] Our last macro memo broke our 100% YTD hit rate in STIR trading - we managed to catch a bit of a move up in Z5 but haven&#8217;t seen any follow through The Upshot The US economy will continue slowing without breaking Overall inflation flat or lower despite tariff effects on goods prices &#8220;The Powell Struggle&#8221; leads to fiscal - monetary convergence Tariff uncertainty resolves The Fed to signal openness to rate cuts Falling long yields to unlock housing market In June, we wrote that the U.S. economy was &#8220;humming along.&#8221; Two months later, that characterization still fits - there is a distinct lack of fresh macro drama, the likes of which prompted us to begin doing monthly macro updates. Since autumn&#8239;2024 our stance has been consistent: headline growth remains resilient even as the labor market cools and disinflation progresses. The intermediate calls that flowed from that thesis have largely been validated, but the macro trading regime has shifted. For the past two years, successful macro traders have largely been those that were focused on fading overreactions at key moments in rates and FX. President Trump&#8217;s recent showdown with Fed Chair Jerome Powell&#8212;what ",
    "source": "https://www.citriniresearch.com/p/macro-memo-the-powell-struggle",
    "date": "2025-07-27T23:13:58.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-16",
    "content": "In case you missed it, our new portal allowing real-time tracking and performance on every thematic basket we cover and our model portfolio recently went live at citrindex.com Introduction Two years ago, CitriniResearch&#8217;s third-ever thematic primer &#8220; Upgrading from Overweight &#8221; made a host of bold claims about the new class of weight loss drugs, GLP-1s. First, that GLP-1s represent a breakthrough addressing one of the largest health crises in history - the obesity epidemic. We argued that GLP-1s would become ubiquitous, following a trajectory similar to Lipitor or Viagra. Widespread adoption, in turn, would lead to the first &#8220;downtick&#8221; in the U.S. obesity rate for the past four decades. That has begun: Secondly, while we expected GLP-1 manufacturer share prices to increase in the near term, we were unique in predicting that long-term second-order effects of a successful weight loss drug would be the most enticing trade as competition heated up for the manufacturers (leaving only a few key &#8220;winners&#8221;). While many of our trades on these second-order effects had strong performance (shorts on obesity related medical devices, alcohol suppliers, and unhealthy foods), we felt that moves were primarily the result of the market attempting to &#8220;front run&#8221; the impact. This concern, combined with the risk of patent cliff and compounded pharmaceuticals/grey market peptides on GLP-1 manufacturer economics, caused us to exit the basket in November 2024 . We realized a 75% gain over the span of 14 months, and promised to continue monitoring what we believe is a generational inflection. Now, the thing about second-order effects is that the first-order has to play out to some critical degree. Based on prescription numbers, it is clear that more and more people are using these drugs. At the end of 2024, nearly 4% of U.S. adults had a prescription for GLP-1 drugs. With more than 30% of the U.S. adult population suffering from obesity,",
    "source": "https://www.citriniresearch.com/p/glp-1s-the-second-serving",
    "date": "2025-07-24T13:27:06.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-17",
    "content": "Introduction Leading and lagging edge technology are converging at an accelerating pace. AI has reshaped the digital landscape, the next step is now entering the physical world. &#8220;Robotics&#8221; serves as a useful umbrella, but it&#8217;s worth elaborating on what exactly that means. Robots have long replaced routine prescribed movements with precision and efficiency, but modern robotics will think in ways they haven&#8217;t before. Breakthroughs in VLA models have continued to filter through to the real world, with Amazon&#8217;s Vulcan robot arm demonstrating significant improvements in sensing (i.e. the ability to perceive the fragility of packages based on tactile perception). Modern robots will come in all forms &#8211; autonomous cars, smart industrial arms, factory shuttles, and yes, eventually, humanoids. But they will share core functions, and will be built with overlapping technology. And the core of our thesis rests on the cyclical nature of the robotics supply chain - a heavily automotive-exposed cycle that has, to put it mildly, seen better days. Since publishing our primer in May, renewed optimism surrounding the automation has resulted in some meaningful outperformance of our broader robotics universe and our narrowed robotics basket. The environment for these bombed out companies, many with cynically cyclical multiples, remains constructive. We see many with the potential to capture a narrative driven re-rating on the back of a durable inflection. In this thematic update: First, we teamed up with financial news and investigative reporting firm Hunterbrook Media to dive deep into the story behind Teradyne&#8217;s (TER) underappreciated but significant upside to robotics. Second, we dive into a robotics cost curve analysis resulting from our recent trip to China. From June 22nd to July 1st, CitriniResearch went to visit eleven companies in the robotics supply chain, including humanoid cost-curve champion Unitree, to discern exactly where competit",
    "source": "https://www.citriniresearch.com/p/robotics-update",
    "date": "2025-07-10T12:30:28.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-18",
    "content": "Introduction Modern warfare has evolved. Cheap drones are torching billion-dollar fortresses and countries are waging direct warfare from thousands of miles away. Last year, Houthi drones successfully blocked global commerce through the Red Sea despite US carrier strike groups stationed in the region. More recently, Ukraine unleashed a surprise attack of 104 drones 800km deep into Russian territory, lighting up the Kirishi refinery and significantly damaging Moscow&#8217;s aerial assault capabilities. Weeks later, Israel ran the same playbook, using smuggled drones (along with traditional assets) to wreak havoc on Iranian nuclear facilities and military targets as a part of its broader &#8220;preemptive strike&#8221; on the country. Tehran responded to Israeli air strikes by hurling hundreds of Shahed drones, cruise missiles, and ballistic missiles towards Tel Aviv and interior targets. Israel&#8217;s missile defenses have successfully blocked a large majority of the strikes, but at roughly $45,000 per Tamir shot such defenses are not free or unlimited. Iranian ballistic missiles have continued to penetrate the Iron Dome, causing direct damage on civilian and military installments. The U.S.&#8217; involvement began with a USAF crew that never had feet on the ground anywhere outside of Missouri. Iran, the US and Israel are ostensibly &#8220;at war&#8221; (or at least in conflict). This is occurring with no troops deployed on foreign soil and each country thousands of miles away from the other. What becomes clear across these various theaters is a shift in the strategy and tactics of modern warfare that challenges the traditional views of asymmetry. We have entered the new WFH , that is, &#8220;War from Home&#8221;. The implications: for under-resourced countries, a new form of leverage, for countries with lots of resources, a wake-up call. This pattern recurs throughout history: technology wins wars. Great powers that rely on yesterday&#8217;s tactics can be quickly ",
    "source": "https://www.citriniresearch.com/p/the-new-wfh-war-from-home",
    "date": "2025-06-23T16:17:18.000Z",
    "platform": "substack"
  },
  {
    "id": "substack-19",
    "content": "Introduction The foundational framework for Citrini Research is the hunt for megatrends in markets &#8211; these are secular shifts with the potential to transform industries and the parts of society they touch. Meanwhile, we are also traders and, as such, attentive to entries. The best entry points, we believe, are often found at cyclical inflections. Those periods when a rebound from a &#8220;crash&#8221; or a &#8220;bust&#8221; is in progress but market sentiment remains depressed present fertile hunting grounds for new themes. Ouster (OUST US) represents a perfect example, and so we were thrilled to have the opportunity recently to sit down with the company&#8217;s Chief Executive Officer and Co-Founder, Angus Pacala, and SVP, Chen Geng. Our view is that Ouster is positioned squarely in the center of the mega-trend that is robotics and automation, which is why we included it in our basket for our most recent thematic primer, Humanoid Robots. Citrini Research Humanoid Robots Yes, robots&#8230; Read more 9 months ago &#183; 161 likes &#183; 49 comments &#183; Citrini As the largest Western LiDAR provider, Ouster has carved out a leading position in the competitive LiDAR market. LiDAR stands for Li ght D etection a nd R anging, and it is a remote sensing technology that measures distance by illuminating a target with laser light and then analyzing the reflected pulses. Ouster&#8217;s digital technology integrates LiDAR onto CMOS chips for cost and performance benefits with a diversification strategy across automotive, industrial, robotics, and smart infrastructure. Ouster is targeting significant growth in all four verticals, and sees the market for LiDAR technology as a $70 billion opportunity, with expectations that the adoption of LiDAR outside of automotive will surpass that within the automotive sector. The company anticipates substantial volume growth as customers transition from prototypes to commercialization. Overall, Ouster is optimistic about the potenti",
    "source": "https://www.citriniresearch.com/p/in-conversation-ouster-oust-us",
    "date": "2025-06-19T15:35:04.000Z",
    "platform": "substack"
  }
]